*&---------------------------------------------------------------------*
*&  모듈       : SD
*&  프로그램 ID : SAPMZGTSDR1230
*&  프로그램 명  : 고객불만 처리
*&  개요       : 가온전선_고객불만 처리
*&              SAPMZQM0020 COPY 생성
*&  생성일      : 2026.03.18
*&  생성자      : ZGODEV01
*&---------------------------------------------------------------------*
*& 외부호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요 :
*&---------------------------------------------------------------------*

INCLUDE MZGTSDR1230TOP.                            " Global Data

INCLUDE MZGTSDR1230O01.                            " PBO-Modules
INCLUDE MZGTSDR1230O02.

INCLUDE MZGTSDR1230I01.                            " PAI-Modules
INCLUDE MZGTSDR1230I02.

INCLUDE MZGTSDR1230F01.                            " FORM-Routines
INCLUDE MZGTSDR1230F02.
INCLUDE MZGTSDR1230F03.
