*&---------------------------------------------------------------------*
*& Report ZGTLER1140
*&---------------------------------------------------------------------*
*&---------------------------------------------------------------------*​
*& 모듈        : SD.
*& 프로그램 ID : ZGTLER1140.
*& 프로그램 명 : [GT] 통문확정/취소.
*& 개요   :
*& 생성일 : 2026.01.14.​
*& 생성자 : ZGODEV05.
*&---------------------------------------------------------------------*​
*& 외부 호출 프로그램 개요   :
*& 타 시스템 인터페이스 개요 : ​
*&---------------------------------------------------------------------*​
*& 프로그램 수정이력​
*&---------------------------------------------------------------------*​
*& 수정일  :​ 2026.01.14.
*& 수정자  :​ ZGODEV05.
*& 수정개요: Create. ( copy ZLER0014 ).
*&---------------------------------------------------------------------*

REPORT zgtler1140  MESSAGE-ID zgtsd01.

INCLUDE zgtler1140c01.
INCLUDE zgtler1140top.    " Top.
INCLUDE zgtler1140alv.
INCLUDE zgtler1140sel.    " Selection-Screen.
INCLUDE zgtler1140f01.
INCLUDE zgtler1140o01.
INCLUDE zgtler1140i01.

*&---------------------------------------------------------------------*
*& INITIALIZATION.
*&---------------------------------------------------------------------*
INITIALIZATION.
  PERFORM initialization.

*&---------------------------------------------------------------------*
*& AT SELECTION-SCREEN.
*&---------------------------------------------------------------------*
AT SELECTION-SCREEN.
* 사업장 Check
  PERFORM check_input(zler0012) USING p_bzarea.

* 권한 Check
  PERFORM authority_check.

* IP Check
  PERFORM ip_check.

*&---------------------------------------------------------------------*
*& AT SELECTION-SCREEN OUTPUT.
*&---------------------------------------------------------------------*
AT SELECTION-SCREEN OUTPUT.
  PERFORM screen_1000.

*&---------------------------------------------------------------------*
*& AT SELECTION-SCREEN ON VALUE-REQUEST.
*&---------------------------------------------------------------------*
AT SELECTION-SCREEN ON VALUE-REQUEST FOR p_gubun1 .
  PERFORM value_request USING 'GUBUN1' .

*&---------------------------------------------------------------------*
*& START-OF-SELECTION.
*&---------------------------------------------------------------------*
START-OF-SELECTION.
  PERFORM start_process.

*&---------------------------------------------------------------------*
*& END-OF-SELECTION.
*&---------------------------------------------------------------------*
END-OF-SELECTION.
  PERFORM end_process.
