************************************************************************
*  Program ID     : ZGTSDR1410
*  Module         : SD
*  Title          : [GT] 판매오더 변경.취소 요청 접수
*  Type           : Report
*  Reference      :
*  Description    : 판매오더 변경.취소 요청 접수
*                   이미 등록된 판매오더의 변경 또는 취소 요청을 받아서
*                   등록하는 프로그램이다.
*                   판매처로 부터 받은 내역은 영업에서 등록한다.
*                   생산관리에서 생산불가 할 경우에는 판매오더 취소로
*                   등록한다.
************************************************************************
*                        Change History
************************************************************************
*  MOD#Date.      Developer.                 description.
* -----------    -----------    -------------------------------------
*   2026.09.21    ZLSGABAP2                INITIAL RELEASE
************************************************************************
REPORT ZGTSDR1410 MESSAGE-ID ZGTSD01.

*-----------------------------------------------------------------------
* INCLUDE
*-----------------------------------------------------------------------
INCLUDE ZGTSDR1410TOP.
INCLUDE ZGTSDR1410SCR.
INCLUDE ZGTSDR1410C01.
INCLUDE ZGTSDR1410O01.
INCLUDE ZGTSDR1410I01.
INCLUDE ZGTSDR1410F01.

*-----------------------------------------------------------------------
* INITIALIZATION
*-----------------------------------------------------------------------
INITIALIZATION.

*-----------------------------------------------------------------------
* AT SELECTION-SCREEN OUTPUT
*-----------------------------------------------------------------------
AT SELECTION-SCREEN OUTPUT .
  PERFORM SELECTION_SCREEN.

*-----------------------------------------------------------------------
* AT SELECTION-SCREEN ON VALUE-REQUEST
*-----------------------------------------------------------------------
AT SELECTION-SCREEN ON VALUE-REQUEST FOR P_REASON.
  PERFORM F4_REASON CHANGING P_REASON.


*-----------------------------------------------------------------------
* AT SELECTION-SCREEN
*-----------------------------------------------------------------------
AT SELECTION-SCREEN ON P_VBELN.
  PERFORM GET_KUNNR.

AT SELECTION-SCREEN ON P_REQT.
  PERFORM GET_REQTYPE.

AT SELECTION-SCREEN ON P_REASON.
  PERFORM GET_REASON.


*-----------------------------------------------------------------------
* START-OF-SELECTION
*-----------------------------------------------------------------------
START-OF-SELECTION.


*-----------------------------------------------------------------------
* END-OF-SELECTION
*-----------------------------------------------------------------------
END-OF-SELECTION.
  CHECK GV_ERROR IS INITIAL.
  CALL SCREEN 100.
