*&---------------------------------------------------------------------*
*& 모듈        : SD
*& 프로그램 ID : ZGTSDR1050
*& 프로그램 명 : [GO] 영업상품 단가 관리
*& 개요   : 가온전선 영업상품 단가 관리
*& 생성일 : 2026.07.20
*& 생성자 : ZGODEV03
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*
*&---------------------------------------------------------------------*
REPORT ZGTSDR1050 MESSAGE-ID ZGTSD01.

INCLUDE ZGTSDR1050TOP.
INCLUDE ZGTSDR1050S01.
INCLUDE ZGTSDR1050C01.
INCLUDE ZGTSDR1050H01.
INCLUDE ZGTSDR1050I01.
INCLUDE ZGTSDR1050O01.
INCLUDE ZGTSDR1050F01.

START-OF-SELECTION.
  PERFORM GET_DATA.

  CALL SCREEN 0100.
