*&---------------------------------------------------------------------*
*& Include          ZGTSDR1420I01
*&---------------------------------------------------------------------*
*&---------------------------------------------------------------------*
*&      Module  EXIT  INPUT
*&---------------------------------------------------------------------*
*       text
*----------------------------------------------------------------------*
MODULE EXIT INPUT.
  CASE SY-UCOMM.
    WHEN 'BACK' OR 'EXIT' OR 'CANC'.
      LEAVE TO SCREEN 0.
  ENDCASE.
ENDMODULE.
*&---------------------------------------------------------------------*
*&      Module  USER_COMMAND_0100  INPUT
*&---------------------------------------------------------------------*
*       text
*----------------------------------------------------------------------*
MODULE USER_COMMAND_0100 INPUT.

  CASE OK_CODE.
    WHEN 'OKAY'.        "확인
*      PERFORM SET_OKAY.
    WHEN 'NOCHG'.       "변경불가
      CALL SCREEN 0110 STARTING AT 30  12
                       ENDING   AT 125 14.
    WHEN 'POCHG'.       "구매전환
*      PERFORM PO_CHANGE_MASS.
  ENDCASE.

ENDMODULE.
*&---------------------------------------------------------------------*
*&      Module  USER_COMMAND_0110  INPUT
*&---------------------------------------------------------------------*
*       text
*----------------------------------------------------------------------*
MODULE USER_COMMAND_0110 INPUT.
  CASE SY-UCOMM.
    WHEN 'OKAY'.        "확인
      LEAVE TO SCREEN 0.
    WHEN 'CANC'.       "취소
      LEAVE TO SCREEN 0.

  ENDCASE.
ENDMODULE.
