************************************************************************
*  Program ID     : ZGTSDR1420
*  Module         : SD
*  Title          : 판매오더 변경.취소 처리 현황
*  Type           : Report
*  Reference      :
*  Description    : 판매오더 변경.취소 처리 현황
*     판매오더 변경.취소 요청 접수내역을 조회하여 처리하는 프로그램이다.
*        1) 요청내역 조회 -> 승인(생관, 구매) -> 판매오더 변경 처리
*        2) 요청내역 조회 -> 처리불가(생관, 구매) -> 판매오더 변경 불가
************************************************************************
*                        Change History
************************************************************************
*  MOD#Date.      Developer.                 description.
* -----------    -----------    -------------------------------------
*   2026.09.2　    ZLSGABAP2                INITIAL RELEASE
************************************************************************
REPORT ZGTSDR1420 MESSAGE-ID ZGTSD01.

*-----------------------------------------------------------------------
* INCLUDE
*-----------------------------------------------------------------------
INCLUDE ZGTSDR1420TOP.
INCLUDE ZGTSDR1420SCR.
INCLUDE ZGTSDR1420C01.
INCLUDE ZGTSDR1420O01.
INCLUDE ZGTSDR1420I01.
INCLUDE ZGTSDR1420F01.


*-----------------------------------------------------------------------
* INITIALIZATION
*-----------------------------------------------------------------------
INITIALIZATION.
  PERFORM INIT.
*-----------------------------------------------------------------------
* AT SELECTION-SCREEN OUTPUT
*-----------------------------------------------------------------------
AT SELECTION-SCREEN OUTPUT .
  PERFORM SELECTION_SCREEN.

*-----------------------------------------------------------------------
* AT SELECTION-SCREEN ON VALUE-REQUEST
*-----------------------------------------------------------------------
AT SELECTION-SCREEN ON VALUE-REQUEST FOR P_VARI.
  PERFORM F4_VARI CHANGING P_VARI.

*-----------------------------------------------------------------------
* AT SELECTION-SCREEN
*-----------------------------------------------------------------------


*-----------------------------------------------------------------------
* START-OF-SELECTION
*-----------------------------------------------------------------------
START-OF-SELECTION.
  PERFORM GET_DATA.

*-----------------------------------------------------------------------
* END-OF-SELECTION
*-----------------------------------------------------------------------
END-OF-SELECTION.
  CHECK GV_ERROR IS INITIAL.
  CALL SCREEN 100.
