************************************************************************
* Title:         [GT] 소재 전기동 수급계획 전송
* Creator:
* Created date:  26.03.05
* Description:   [GT] 소재 전기동 수급계획 전송
* Issue : 월별로 전송하며 EAI에서 I_ZZMONTH 기준 데이터 삭제 후 데이터 전송
************************************************************************
* Modification log:
* ---------------------------------------------------------------------*
* <Date>    <Changed by>    <Description>
* ---------------------------------------------------------------------*
* 26.03.05   ZLSGSD2      최초생성
************************************************************************
REPORT zgtsdi0008 MESSAGE-ID zgtsd01 NO STANDARD PAGE HEADING.

INCLUDE zgtsdi0008top.
INCLUDE zgtsdi0008c01.
INCLUDE zgtsdi0008sel.
INCLUDE zgtsdi0008o01.
INCLUDE zgtsdi0008i01.
INCLUDE zgtsdi0008f01.

*----------------------------------------------------------------------*
* INITIALIZATION
*----------------------------------------------------------------------*
INITIALIZATION.
  PERFORM initialization.

*----------------------------------------------------------------------*
* AT SELECTION-SCREEN OUTPUT
*----------------------------------------------------------------------*
AT SELECTION-SCREEN OUTPUT.
*  PERFORM modify_screen.

*----------------------------------------------------------------------*
* AT SELECTION-SCREEN
*----------------------------------------------------------------------*

*----------------------------------------------------------------------*
* AT SELECTION-SCREEN ON
*----------------------------------------------------------------------*

*----------------------------------------------------------------------*
* AT SELECTION-SCREEN ON VALUE-REQUEST
*----------------------------------------------------------------------*

*----------------------------------------------------------------------*
* START-OF-SELECTION
*----------------------------------------------------------------------*
START-OF-SELECTION.

  "외부호출시 30초 DELAY
  IF p_call = 'X'.
    WAIT UP TO 30 SECONDS.
  ENDIF.

  CHECK gv_error IS INITIAL.


  "데이터 구성
  PERFORM data_query.

*----------------------------------------------------------------------*
* END-OF-SELECTION
*----------------------------------------------------------------------*
END-OF-SELECTION.

  CHECK gv_error IS INITIAL.
  IF sy-batch is not initial.
    PERFORM send_data.
    PERFORM write_result.
  ELSE.
    CALL SCREEN 0100.
  ENDIF.
