*&---------------------------------------------------------------------*
*&  모듈       : SD
*&  프로그램 ID : ZGTSDR1240
*&  프로그램 명  : 내수고객-로컬지급처 여신연결
*&  개요       : 가온전선_내수고객과 로컬지급처 여신을 연결하기 위한 프로그램
*&  생성일      : 2026.04.14
*&  생성자      : ZGODEV01
*&---------------------------------------------------------------------*
*& 외부호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*----------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요 :
*&---------------------------------------------------------------------*
REPORT ZGTSDR1240 MESSAGE-ID ZGTSD01.

INCLUDE ZGTSDR1240TOP.
INCLUDE ZGTSDR1240C01.
INCLUDE ZGTSDR1240SEL.
INCLUDE ZGTSDR1240ALV.
INCLUDE ZGTSDR1240O01.
INCLUDE ZGTSDR1240I01.
INCLUDE ZGTSDR1240F01.

*----------------------------------------------------------------------*
*     INITIALIZATION                                                   *
*----------------------------------------------------------------------*
INITIALIZATION.
  PERFORM INITIALIZATION.

*----------------------------------------------------------------------*
*     AT SELECTION-SCREEN.                                             *
*----------------------------------------------------------------------*
AT SELECTION-SCREEN.
  PERFORM SELECTION_SCREEN.

*----------------------------------------------------------------------*
*     AT SELECTION-SCREEN OUTPUT.                                      *
*----------------------------------------------------------------------*
AT SELECTION-SCREEN OUTPUT.
  PERFORM SELECTION_SCREEN_OUTPUT.

AT SELECTION-SCREEN ON VALUE-REQUEST FOR P_RELTYP.
  PERFORM F4_RELTYP USING 'P_RELTYP'.


*----------------------------------------------------------------------*
*     START-OF-SELECTION                                               *
*----------------------------------------------------------------------*
START-OF-SELECTION.
  PERFORM MAIN.


*----------------------------------------------------------------------*
*     END-OF-SELECTION                                                 *
*----------------------------------------------------------------------*
END-OF-SELECTION.
  PERFORM DISPLAY.
