*&---------------------------------------------------------------------*
*& Report ZGTSDR1030
*&---------------------------------------------------------------------*
*&---------------------------------------------------------------------*​
*& 모듈        : SD.
*& 프로그램 ID : ZGTSDR1030
*& 프로그램 명 : [GT] 거래처 별 SCR 8.0mm 가공비 단가 관리.
*& 개요   :
*& 생성일 : 2026.03.27.​
*& 생성자 : ZGODEV05.
*&---------------------------------------------------------------------*​
*& 외부 호출 프로그램 개요   :
*& 타 시스템 인터페이스 개요 : ​
*&---------------------------------------------------------------------*​
*& 프로그램 수정이력​
*&---------------------------------------------------------------------*​
*& 수정일  :​ 2026.03.27.
*& 수정자  :​ ZGODEV05.
*& 수정개요: Create.
*&---------------------------------------------------------------------*

REPORT ZGTSDR1030  MESSAGE-ID zgtsd01.

INCLUDE zgtsdr1030c01.
INCLUDE zgtsdr1030top.    " Top.
INCLUDE zgtsdr1030alv.
INCLUDE zgtsdr1030sel.    " Selection-Screen.
INCLUDE zgtsdr1030f01.
INCLUDE zgtsdr1030o01.
INCLUDE zgtsdr1030i01.


*&---------------------------------------------------------------------*
*& INITIALIZATION.
*&---------------------------------------------------------------------*
INITIALIZATION.
  PERFORM initialization.

*----------------------------------------------------------------------*
* AT SELECTION-SCREEN OUTPUT.
*----------------------------------------------------------------------*
AT SELECTION-SCREEN OUTPUT.
  PERFORM modify_screen_1000.

*&---------------------------------------------------------------------*
*& AT SELECTION-SCREEN ON VALUE-REQUEST.
*&---------------------------------------------------------------------*
AT SELECTION-SCREEN ON VALUE-REQUEST FOR s_spmon-low.
  PERFORM f4_spmon  CHANGING s_spmon-low.

AT SELECTION-SCREEN ON VALUE-REQUEST FOR s_vkbur-low.
  PERFORM f4_vkbur  CHANGING s_vkbur-low.

*&---------------------------------------------------------------------*
*& START-OF-SELECTION.
*&---------------------------------------------------------------------*
START-OF-SELECTION.
  PERFORM start_process.

*&---------------------------------------------------------------------*
*& END-OF-SELECTION.
*&---------------------------------------------------------------------*
END-OF-SELECTION.
  PERFORM end_process.
