************************************************************************
* 모듈/서브모듈 : MM / 비철
* Type          : Module Pool
* GAP ID        : NF016
* T_CODE        : ZGTMMR1060(ZNF1M0010)
* Description   : 일별 비철시세관리(기준정보)
*                     가온전선_SAPMZNF0010프로그램 복사 생성
************************************************************************
*                        MODIFICATION LOG                                                      *
*---------------------------------------------------------*
*   DATE        AUTHORS              DESCRIPTION
* ----------   --------- -----------------------------------*
* 2004/09/15    심영섭                Initial Release
* 2012/05/16    황두연                삭제기능 추가
* 2026/06/02   ZGODEV04          복사생성
************************************************************************
* Comment :
************************************************************************

INCLUDE MZGTMMR1060TOP.  " global Data
INCLUDE MZGTMMR1060O01.  " PBO-Modules
INCLUDE MZGTMMR1060I01.    " PAI-Modules
INCLUDE MZGTMMR1060F01.  " FORM-Routines
