************************************************************************
* 모듈/서브모듈 : MM / 비철
* Type          : Module Pool
* GAP ID        : NF016
* T_CODE        : ZGTMMR1061(ZNF1M0020)
* Description   : 월별 비철시세관리(기준정보)
*                     가온전선_SAPMZNF0020프로그램 복사 생성
************************************************************************
*                        MODIFICATION LOG
*---------------------------------------------------------*
*   DATE        AUTHORS              DESCRIPTION
* ----------   --------- -----------------------------------*
* 2004/09/15    심영섭    Initial Release
* 2026/06/02   ZGODEV04          복사생성
************************************************************************
* Comment :
************************************************************************

INCLUDE MZGTMMR1061TOP.  " global Data
INCLUDE MZGTMMR1061O01.  " PBO-Modules
INCLUDE MZGTMMR1061I01.   " PAI-Modules
INCLUDE MZGTMMR1061F01. " FORM-Routines
