*&---------------------------------------------------------------------*
*& 모듈        : MM
*& 프로그램 ID : ZGTMMR2011
*& 프로그램 명 : 구매요청 승인 관리
*& 개요   : 비상비 자재 구매요청에 대한 승인 요청 확인 및 승인 처리 프로그램 개발
*              (요청 금액이 1000만원 이상인 건은 그룹웨어 결재 상신건으로 대상에서 제외함)
*& 생성일 : 2026.03.13
*& 생성자 : ZGODEV07
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요:
*&---------------------------------------------------------------------*
REPORT ZGTMMR2011 MESSAGE-ID ZGTMM01.

INCLUDE ZGTMMR2011TOP.  "Global Variables & Types / Screen
INCLUDE ZGTMMR2011C01.  "Class - ALV
INCLUDE ZGTMMR2011O01.  "PBO
INCLUDE ZGTMMR2011I01.  "PAI
INCLUDE ZGTMMR2011F01.  "Sub-routines
INCLUDE ZGTMMR2011F02.  "Sub-routines for ALV
INCLUDE ZGTMMR2011E01.  "Event
