FUNCTION ZGTMM_IF_O_BATCHTAGNR.
*"----------------------------------------------------------------------
*"*"Local Interface:
*"  EXPORTING
*"     VALUE(E_ZRESULT) TYPE  BAPI_MTYPE
*"     VALUE(E_MESSAGE) TYPE  BAPI_MSG
*"  TABLES
*"      OT_TAB STRUCTURE  ZGTMMSIF0045 OPTIONAL
*"----------------------------------------------------------------------
*&---------------------------------------------------------------------*
*& 모듈          : MM
*& 프로그램 ID : ZGTMM_IF_O_BATCHTAGNR
*& 프로그램 명 : 배치&꼬리표 정보 전송
*& 개요   : 배치&꼬리표 정보 전송
*& 생성일 : 2025.04.03
*& 생성자 : ZGSIDEV03
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요:
*&---------------------------------------------------------------------*




ENDFUNCTION.
