*&---------------------------------------------------------------------*
*& 모듈          : MM
*& 프로그램 ID : ZGTMMR4916
*& 프로그램 명 : 자재-업체 매핑 정보 전송관리
*& 개요   : 자재-업체 매핑 정보 전송관리(To 지중MES)
*&        자재 별 공급 가능 업체를 MES에서 조회하기 위한 목적임
*&        (따라서 단가 등의 정보는 전송 없이 자재+업체 정보 전송)
*&        현 Inforecord가 미삭제 미사용 정보가 많아 구매 오더 존재 건만 전송함
*& 생성일 : 2024.11.25
*& 생성자 : ZGSIDEV03
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요:
*&---------------------------------------------------------------------*
REPORT ZGTMMR4916 NO STANDARD PAGE HEADING MESSAGE-ID ZGTMM01.


INCLUDE ZGTMMR4916TOP.
INCLUDE ZGTMMR4916C01.
INCLUDE ZGTMMR4916O01.
INCLUDE ZGTMMR4916I01.
INCLUDE ZGTMMR4916F01.


*----------------------------------------------------------------------*
* INITIALIZATION
*----------------------------------------------------------------------*
INITIALIZATION.
  PERFORM SET_INIT.

*----------------------------------------------------------------------*
* AT SELECTION-SCREEN OUTPUT
*----------------------------------------------------------------------*
AT SELECTION-SCREEN OUTPUT.
  PERFORM MODIFY_SCREEN.

*----------------------------------------------------------------------*
* AT SELECTION-SCREEN
*----------------------------------------------------------------------*
AT SELECTION-SCREEN.
* PERFORM CHECK_AUTH.

*----------------------------------------------------------------------*
* AT SELECTION-SCREEN ON
*----------------------------------------------------------------------*
AT SELECTION-SCREEN ON VALUE-REQUEST FOR P_IFSYT.
  PERFORM F4_IFSYT USING 'P_IFSYT'.

*----------------------------------------------------------------------*
* START-OF-SELECTION
*----------------------------------------------------------------------*
START-OF-SELECTION.
  PERFORM CHECK_COND.
  PERFORM GET_DATA.

  CHECK GV_CNT IS NOT INITIAL.

  IF P_BAT = GC_X.
    PERFORM SEND_DATA USING ' '.
  ELSE.
    CALL SCREEN 100.
  ENDIF.
