*&---------------------------------------------------------------------*
*& 모듈          : MM
*& 프로그램 ID : ZGTMMR6600
*& 프로그램 명 : [BD] 구매오더 삭제요청 처리
*& 개요   : 부스닥트 생관에서 제조지시번호에 따라 생성한 구매요청 문서에 대한 구매오더 문서
*&        삭제 요청 데이터를 확인하여 구매오더 삭제를 진행
*& 생성일 : 2025.05.07
*& 생성자 : ZGSIDEV03
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요:
*&---------------------------------------------------------------------*
REPORT ZGTMMR6600 NO STANDARD PAGE HEADING MESSAGE-ID ZGTMM01.


INCLUDE ZGTMMR6600TOP.
INCLUDE ZGTMMR6600C01.
INCLUDE ZGTMMR6600O01.
INCLUDE ZGTMMR6600I01.
INCLUDE ZGTMMR6600F01.


*----------------------------------------------------------------------*
* INITIALIZATION
*----------------------------------------------------------------------*
INITIALIZATION.
  PERFORM SET_INIT.

*----------------------------------------------------------------------*
* AT SELECTION-SCREEN OUTPUT
*----------------------------------------------------------------------*
AT SELECTION-SCREEN OUTPUT.
* PERFORM MODIFY_SCREEN.

*----------------------------------------------------------------------*
* AT SELECTION-SCREEN
*----------------------------------------------------------------------*
AT SELECTION-SCREEN.
  PERFORM CHECK_AUTH.

*----------------------------------------------------------------------*
* START-OF-SELECTION
*----------------------------------------------------------------------*
START-OF-SELECTION.
  PERFORM GET_DATA.

  CHECK GV_CNT IS NOT INITIAL.
  CALL SCREEN 100.
