FUNCTION ZGTMM_IF_O_FIBERGRDETAIL_SEND.
*"----------------------------------------------------------------------
*"*"Local Interface:
*"  IMPORTING
*"     VALUE(I_SYSTEM_ID) TYPE  CHAR04
*"  EXPORTING
*"     VALUE(ZO_RESULT) TYPE  ZO_RESULT
*"     VALUE(ZO_MESSAGE) TYPE  ZO_MESSAGE
*"  TABLES
*"      OT_ITEM STRUCTURE  ZGTMMS4008
*"----------------------------------------------------------------------
*&---------------------------------------------------------------------*
*& 모듈          : MM
*& 프로그램 ID : ZGTMM_IF_O_FIBERGRDETAIL_SEND
*& 프로그램 명 :  Fiber 입고 정보 전송(SAP->MES)
*& 개요   : FIBER 시험성적서 기반 입고 세부 정보를 전송하는FUNCTION
*& 생성일 : 2026.05.10
*& 생성자 : ZGOMM01
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요:
*&---------------------------------------------------------------------*




ENDFUNCTION.
