*&---------------------------------------------------------------------*
*& 모듈        : MM
*& 프로그램 ID : ZGTMMR4320
*& 프로그램 명 : 공급업체 납품서 전송 관리
*& 개요   : MES 에서 생성된 재고 이전 예약오더정보 조회 및 이전전기 처리하는 프로그램개발
*& 생성일 : 2026.02.06
*& 생성자 : ZGODEV07
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요:
*&---------------------------------------------------------------------*
REPORT ZGTMMR4320 MESSAGE-ID ZGTMM01.

INCLUDE ZGTMMR4320TOP.  "Global Variables & Types / Screen
INCLUDE ZGTMMR4320C01.  "Class - ALV
INCLUDE ZGTMMR4320O01.  "PBO
INCLUDE ZGTMMR4320I01.  "PAI
INCLUDE ZGTMMR4320F01.  "Sub-routines
INCLUDE ZGTMMR4320F02.  "Sub-routines for ALV
INCLUDE ZGTMMR4320E01.  "Event
