*&---------------------------------------------------------------------*
*& 모듈          : MM
*& 프로그램 ID : ZGTMMR6500
*& 프로그램 명 : [BD] MTS 부스바 원자재 구매요청
*& 개요   : MTS 부스바에 대한 구매요청 생성 Pgm.으로 길이와 수량으로 중량을 계산하여 PR을 요청
*& 생성일 : 2025.02.24
*& 생성자 : ZGSIDEV03
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요:
*&---------------------------------------------------------------------*
REPORT ZGTMMR6500 NO STANDARD PAGE HEADING MESSAGE-ID ZGTMM01.


INCLUDE ZGTMMR6500TOP.
INCLUDE ZGTMMR6500C01.
INCLUDE ZGTMMR6500O01.
INCLUDE ZGTMMR6500I01.
INCLUDE ZGTMMR6500F01.


*----------------------------------------------------------------------*
* INITIALIZATION
*----------------------------------------------------------------------*
INITIALIZATION.
  PERFORM SET_INIT.

*----------------------------------------------------------------------*
* AT SELECTION-SCREEN OUTPUT
*----------------------------------------------------------------------*
AT SELECTION-SCREEN OUTPUT.
  PERFORM MODIFY_SCREEN.

*----------------------------------------------------------------------*
* AT SELECTION-SCREEN
*----------------------------------------------------------------------*
AT SELECTION-SCREEN.
  PERFORM CHECK_COND.
  PERFORM CHECK_AUTH.

*----------------------------------------------------------------------*
* AT SELECTION-SCREEN ON
*----------------------------------------------------------------------*
AT SELECTION-SCREEN ON VALUE-REQUEST FOR S_FLIEF-LOW.
  PERFORM F4_S_FLIEF USING 'S_FLIEF-LOW'.

AT SELECTION-SCREEN ON VALUE-REQUEST FOR S_FLIEF-HIGH.
  PERFORM F4_S_FLIEF USING 'S_FLIEF-HIGH'.

*----------------------------------------------------------------------*
* START-OF-SELECTION
*----------------------------------------------------------------------*
START-OF-SELECTION.
  PERFORM GET_DATA.

  CHECK GV_CNT IS NOT INITIAL.
  CALL SCREEN 100.
