*&---------------------------------------------------------------------*
*& Include          ZGTMMR4900I01
*&---------------------------------------------------------------------*
*&---------------------------------------------------------------------*
*&      Module  EXIT  INPUT
*&---------------------------------------------------------------------*
*       text
*----------------------------------------------------------------------*
MODULE EXIT INPUT.

  CASE GV_OKCODE.
    WHEN 'EXIT'. "OR 'CANC'.
      PERFORM FREE_OBJ.
      LEAVE PROGRAM.

  ENDCASE.

  CLEAR : GV_OKCODE.

ENDMODULE.
*&---------------------------------------------------------------------*
*&      Module  PAI_0100  INPUT
*&---------------------------------------------------------------------*
*       text
*----------------------------------------------------------------------*
MODULE PAI_0100 INPUT.

  "'CANC'(ESC) 일때 프로그램을 나가지 않도록(송종면E 25.01.14)

  CLEAR : GV_REF.

  CASE GV_OKCODE.
    WHEN 'BACK' OR 'CANC'.
      PERFORM FREE_OBJ.
      SET SCREEN 0.

    WHEN 'REFR'. "재조회
      PERFORM GET_DATA USING 'X'. "추가(송종면E 24.12.10)
      GV_REF = GC_X.

  ENDCASE.

  CLEAR : GV_OKCODE.

ENDMODULE.
