FUNCTION ZGTMM_IF_O_DIRECTGR.
*"----------------------------------------------------------------------
*"*"Local Interface:
*"  EXPORTING
*"     VALUE(E_ZRESULT) TYPE  BAPI_MTYPE
*"     VALUE(E_MESSAGE) TYPE  BAPI_MSG
*"  TABLES
*"      OT_TAB STRUCTURE  ZGTMMSIF0043 OPTIONAL
*"----------------------------------------------------------------------
*&---------------------------------------------------------------------*
*& 모듈          : MM
*& 프로그램 ID : ZGTMM_IF_O_DIRECTGR
*& 프로그램 명 : 직납 납품서 입고 결과 송신
*& 개요   : E-Pro에서 검수한 직납 납품 정보에 대해 입고 처리한 결과를 송신
*& 생성일 : 2025.02.06
*& 생성자 : ZGSIDEV03
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요:
*&---------------------------------------------------------------------*




ENDFUNCTION.
