*&---------------------------------------------------------------------*
*& 모듈        : MM
*& 프로그램 ID : ZGTMMR2000
*& 프로그램 명 : 구매요청 전송 관리
*& 개요   : SAP 에서 생성한 구매요청 정보를 GSRM 으로 송신,
*&           이력 조회 할수 있는 관리 프로그램 개발
*& 생성일 : 2026.01.05.
*& 생성자 : ZGODEV07
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : SAP -> EAI -> G-SRM
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요:
*&---------------------------------------------------------------------*
REPORT ZGTMMR2000 MESSAGE-ID ZGTMM01.

INCLUDE ZGTMMR2000TOP.  "Global Variables & Types / Screen
INCLUDE ZGTMMR2000C01.  "Class - ALV
INCLUDE ZGTMMR2000O01.  "PBO
INCLUDE ZGTMMR2000I01.  "PAI
INCLUDE ZGTMMR2000F01.  "Sub-routines
INCLUDE ZGTMMR2000F02.  "Sub-routines for ALV
INCLUDE ZGTMMR2000E01.  "Event
