*&---------------------------------------------------------------------*
*& 모듈        : MM
*& 프로그램 ID : ZGTMMR1120
*& 프로그램 명 : 비상비 자재 관리
*& 개요   : [가온전선] 비상비 자재마스터를 생성/유지보수하는 프로그램
*& 생성일 : 2026.04.16
*& 생성자 : ZGODEV07
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요:
*&---------------------------------------------------------------------*
REPORT ZGTMMR1120 MESSAGE-ID ZGTMM01.

INCLUDE ZGTMMR1120TOP.  "Global Variables & Types / Screen
INCLUDE ZGTMMR1120C01.  "Class - ALV
INCLUDE ZGTMMR1120O01.  "PBO
INCLUDE ZGTMMR1120I01.  "PAI
INCLUDE ZGTMMR1120F01.  "Sub-routines
INCLUDE ZGTMMR1120F02.  "Sub-routines for ALV
INCLUDE ZGTMMR1120E01.  "Event
