*&---------------------------------------------------------------------*
*& 모듈풀            SAPMZLE0001                                                                                     *
*&---------------------------------------------------------------------*
************************************************************************
*  Program ID  : ZGTMMR4540(SAPMZLE0001)
*  Title       : [MM] 기타통문 요청
*  Create Date : 2026.05.21(2004. 12. 07)
*  Author      : SDC08
*  Frequency   : Frequency
*  Doc. ID     : FT_SAPMZLE0001_기타통문 요청.doc
*  GAP NO      : LES022
*  DESCRIPTION : 기존 SAPMZLE0001 프로그램 복사 생성 후 테이블 및 티코드 변경
************************************************************************
*  Changed by  |  Description of change                    |  Date
*              |                                           |
*  S.J.NAM     |기능개선44943 - 통문증 발행시              |
*              |타사의 플랜트 입력 방지                    |2014.09.30
*  H.M.LIM     |기능개선48112 - 기타통문증 요청화면 변경   |2014.10.15
*  H.M.LIM     |기능개선48116 - 기타통문 결재 프로세스 도입|2014.10.21
************************************************************************
*                        MODIFICATION LOG
*----------------------------------------------------------------------*
*  Date.     Author.  CSR#.            Description.
*----------------------------------------------------------------------*
* 2014.11.07 S.J.Nam  자체개선 52275   기타통문증 발행시 메시지추가
* 2014.11.13 H.M.LIM  자체개선 52915   구매처,납품처 코드 길이 수정
* 2015.03.09 H.M.LIM  기능개선 69869   통문관리 프로그램 개선
* 2015.04.02 S.J.NAM  기능개선 43039   결재자/합의자 개인ID 사용자로제한
* 2018.03.16 노승남   기능개선 228147  통문유형 'E12' 추가
* 2018.03.27 노승남   기능개선 229448  통문유형 'E12' 필드 조정
* 2018.06.13 ZLSGSD   기능개선 238656  합의자 sh 수정
* 2018.06.22 노승남   기능개선 239718  LS MTRON 통문 승인 기능 추가
* 2018.10.24 노승남   기능개선 251794  통문유형 'E99'에 사유필드 추가
* 2019.02.18 ZLSGSD   기능개선 266459  통문승인자 F4추가 외 (U1)
* 2019.04.15 노승남   기능개선 276257  통문유형 'E06'에 자재코드 추가
* 2019.04.23 노승남   기능개선 277121  자재코드 필드가 숨김 처리된 경우
*                                      필수필드 입력 오류 메시지 수정
* 2020.02.04 ZLSGSD   기능개선 307461  통문유형 E31 추가
* 2022.09.23 ZLSGSD   SRM2209-05218    트랙터부품 사외이전 관련 통문개선
* 2025.02.21 ZLSGSD2 CHM2502-00443 E99 간편결재 미사용
************************************************************************

INCLUDE ZGTMMR4540TOP.                   " Global Data
INCLUDE ZGTMMR4540O01.                   " PBO-Modules
INCLUDE ZGTMMR4540I01.                   " PAI-Modules
INCLUDE ZGTMMR4540F01.                   " FORM-Routines
