*&---------------------------------------------------------------------*
*& 모듈          : MM
*& 프로그램 ID : ZGTMMR6200
*& 프로그램 명 : [BD] 부스닥트 구매확정
*& 개요   : 1)제조지시에 따른 원/부자재에 대한 구매요청 생성
*&         2)제조지시에 따른 상품/외주임가공/외주완제품에 대한 구매오더 생성
*& 생성일 : 2025.01.17
*& 생성자 : ZGSIDEV03
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요:
*&---------------------------------------------------------------------*
REPORT ZGTMMR6200 NO STANDARD PAGE HEADING MESSAGE-ID ZGTMM01.


INCLUDE ZGTMMR6200TOP.
INCLUDE ZGTMMR6200C01.
INCLUDE ZGTMMR6200O01.
INCLUDE ZGTMMR6200I01.
INCLUDE ZGTMMR6200F01.


*----------------------------------------------------------------------*
* INITIALIZATION
*----------------------------------------------------------------------*
INITIALIZATION.
  PERFORM SET_INIT.

*----------------------------------------------------------------------*
* AT SELECTION-SCREEN OUTPUT
*----------------------------------------------------------------------*
AT SELECTION-SCREEN OUTPUT.
  PERFORM MODIFY_SCREEN.

*----------------------------------------------------------------------*
* AT SELECTION-SCREEN
*----------------------------------------------------------------------*
AT SELECTION-SCREEN.
* PERFORM CHECK_AUTH.

*----------------------------------------------------------------------*
* START-OF-SELECTION
*----------------------------------------------------------------------*
START-OF-SELECTION.
  PERFORM CHECK_COND.
  PERFORM GET_DATA.
  PERFORM SET_LOCK USING 'X'.

  CHECK GV_CNT IS NOT INITIAL.
  CALL SCREEN 100.
