*&--------------------------------------------------------*
*& 모듈           : MM                                                                              *
*& 프로그램 ID : ZGTMMR4382                                                                *
*& 프로그램 명 : [MM] 불용자재 재고폐기 관리
*& 개요          :가온전선_불용 자재로 판단한 재고 수량에 대해 폐기 출고 처리를
*                    위한 프로그램 개발
*& 생성일       : 2026.05.19                                                                    *
*& 생성자      : ZGODEV04                                                                      *
*&--------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A                                                            *
*& 타 시스템 인터페이스 개요 : N/A                                                           *
*&-------------------------------------------------------*
*& 프로그램 수정이력
*&-------------------------------------------------------*
*&     수정일             수정자             수정개요
*& ----------   ---------  ---------------------------------*
*&
*&-------------------------------------------------------*
REPORT ZGTMMR4382 MESSAGE-ID ZGTMM01.

*&-------------------------------------------------------*
*&    INCLUDE.
*&-------------------------------------------------------*
INCLUDE ZGTMMR4382TOP.   " GLOBAL DATA
INCLUDE ZGTMMR4382C01.   " ALV CLASS
INCLUDE ZGTMMR4382O01.   " PBO-MODULES
INCLUDE ZGTMMR4382I01.   " PAI-MODULES
INCLUDE ZGTMMR4382F01.  " FORM-ROUTINES


*&---------------------------------------------------------------------*
*&    INITIALIZATION.
*&---------------------------------------------------------------------*
INITIALIZATION.
  PERFORM INITIALIZATION. "초기값 세팅

*&---------------------------------------------------------------------*
*&    AT SELECTION-SCREEN.
*&---------------------------------------------------------------------*
AT SELECTION-SCREEN OUTPUT.
  PERFORM SELECTION_SCREEN_OUTPUT. "스크린 PBO
  PERFORM SELECT_BWART USING P_WERKS.

AT SELECTION-SCREEN.
  PERFORM CHECK_AUTH.

*&---------------------------------------------------------------------*
*&    START-OF-SELECTION.
*&---------------------------------------------------------------------*
START-OF-SELECTION.

  PERFORM INPUT_VALIDATION.      "INPUT DATA VALIDATION CHECK
  CHECK GV_ERR IS INITIAL.

  PERFORM GET_DATA.


*&---------------------------------------------------------------------*
*&    END-OF-SELECTION.
*&---------------------------------------------------------------------*
END-OF-SELECTION.

  CHECK GV_ERR IS INITIAL.
  CALL SCREEN 100.
