*&---------------------------------------------------------------------*
*& 모듈        : MM
*& 프로그램 ID : ZGTMMR2020
*& 프로그램 명 : SKID 구매요청 관리
*& 개요   : [가온전선] 판매오더를 기반으로 SKID 팔레트의 구매요청을 생성/조회하는 프로그램
*& 생성일 : 2026.05.06
*& 생성자 : ZGODEV04
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요:
*&---------------------------------------------------------------------*
REPORT ZGTMMR2020 MESSAGE-ID ZGTMM01.

INCLUDE ZGTMMR2020TOP.             " Global Data
INCLUDE ZGTMMR2020C01.              " Class-ALV
INCLUDE ZGTMMR2020O01.              " PBO
INCLUDE ZGTMMR2020I01.                " PAI
INCLUDE ZGTMMR2020F01.               " Sub-routines
INCLUDE ZGTMMR2020F02.               " Sub-routines for ALV
INCLUDE ZGTMMR2020E01.               "Event
