*&---------------------------------------------------------------------*
*& 모듈        : MM
*& 프로그램 ID : ZGTMMR4350
*& 프로그램 명 : 공급업체 입고 실적 등록/조회
*& 개요   : 배치 관리 대상 품목에 대해 FIBER, SCR 입고시 공급업체에서
*       제공한 라벨 정보를(시험성적서 등) 등록 이력을 관리하는 프로그램 개발
*& 생성일 : 2026.04.24
*& 생성자 : ZGODEV07
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  : 2026.07.07
*& 수정자  : ZGODEV04
*& 수정개요: '조회' 조건일 경우, 저장된 데이터 수정 가능하게 기능 추가
*&---------------------------------------------------------------------*
REPORT ZGTMMR4350 MESSAGE-ID ZGTMM01.

INCLUDE ZGTMMR4350TOP.  "Global Variables & Types / Screen
INCLUDE ZGTMMR4350C01.  "Class - ALV
INCLUDE ZGTMMR4350O01.  "PBO
INCLUDE ZGTMMR4350I01.  "PAI
INCLUDE ZGTMMR4350F01.  "Sub-routines
INCLUDE ZGTMMR4350F02.  "Sub-routines for ALV
INCLUDE ZGTMMR4350E01.  "Event
