*&---------------------------------------------------------------------*
*& 모듈        : MM
*& 프로그램 ID : ZGTMMR1130
*& 프로그램 명 : OEM 단가 예가 정보 조회
*& 개요   :
*& 생성일 : 2026.07.09
*& 생성자 : ZGODEV04
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요:
*&---------------------------------------------------------------------*
REPORT ZGTMMR1130 MESSAGE-ID ZGTMM01.

INCLUDE ZGTMMR1130TOP.  "Global Variables & Types / Screen
*INCLUDE ZGTMMR4390C01.  "Class - ALV
INCLUDE ZGTMMR1130O01. "PBO
INCLUDE ZGTMMR1130I01.   "PAI
INCLUDE ZGTMMR1130F01.  "Sub-routines
INCLUDE ZGTMMR1130F02.  "Sub-routines for ALV
INCLUDE ZGTMMR1130E01.  "Event
