*&---------------------------------------------------------------------*
*& 모듈        : MM
*& 프로그램 ID : ZGTMMR4381
*& 프로그램 명 : 스크랩 자재 재고 조정 관리
*& 개요   : 계근 정보 기반으로 입력한 스크랩 자재 재고를 조회
*&           실물 기준으로 재고 조정 처리하는 프로그램 개발
*& 생성일 : 2026.05.13
*& 생성자 : ZGODEV04
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요:
*&---------------------------------------------------------------------*
REPORT ZGTMMR4381 MESSAGE-ID ZGTMM01.

INCLUDE ZGTMMR4381TOP.             " Global Data
INCLUDE ZGTMMR4381C01.              " Class-ALV
INCLUDE ZGTMMR4381O01.              " PBO
INCLUDE ZGTMMR4381I01.                " PAI
INCLUDE ZGTMMR4381F01.               " Sub-routines
INCLUDE ZGTMMR4381F02.               " Sub-routines for ALV
INCLUDE ZGTMMR4381E01.               "Event
