FUNCTION ZGTMM_IF_O_DRUM_SEND.
*"----------------------------------------------------------------------
*"*"Local Interface:
*"  IMPORTING
*"     VALUE(I_SYSTEM_ID) TYPE  ZGTE_IF_TARGET
*"     VALUE(I_BUKRS) TYPE  BUKRS
*"  EXPORTING
*"     VALUE(ZO_RESULT) TYPE  ZO_RESULT
*"     VALUE(ZO_MESSAGE) TYPE  ZO_MESSAGE
*"  TABLES
*"      OT_DRUM STRUCTURE  ZGTMMS9000
*"----------------------------------------------------------------------
*&---------------------------------------------------------------------*
*& 모듈          : MM
*& 프로그램 ID : ZGTMM_IF_O_DRUM_SEND
*& 프로그램 명 : 목드럼 마스터 정보 전송(SAP->G-SRM)
*& 개요   : 목드럼/플라스틱 드럼 입고에 필요한 자재마스터를 전송 하는 FUNCTION
*& 생성일 : 2026.01.09
*& 생성자 : ZGODEV04
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요:
*&---------------------------------------------------------------------*





ENDFUNCTION.
