*&---------------------------------------------------------------------*
*& Include          ZGTMMR4000I01
*&---------------------------------------------------------------------*
*&---------------------------------------------------------------------*
*&      Module  EXIT  INPUT
*&---------------------------------------------------------------------*
*       text
*----------------------------------------------------------------------*
MODULE EXIT INPUT.

  CASE GV_OKCODE.
    WHEN 'EXIT'. "OR 'CANC'.
      PERFORM CHECK_EXIT USING 'C'.

  ENDCASE.

  CLEAR : GV_OKCODE.

ENDMODULE.
*&---------------------------------------------------------------------*
*&      Module  PAI_0100  INPUT
*&---------------------------------------------------------------------*
*       text
*----------------------------------------------------------------------*
MODULE PAI_0100 INPUT.

  "'CANC'(ESC) 일때 프로그램을 나가지 않도록(송종면E 25.01.14)

  CLEAR : GV_REF.

  CASE GV_OKCODE.
    WHEN 'BACK' OR 'CANC'.
      PERFORM CHECK_EXIT USING 'N'.

    WHEN 'COPY'. "직납공급처 복사
      PERFORM PRCS_COPY.

  ENDCASE.

  CLEAR : GV_OKCODE.

ENDMODULE.
