*&---------------------------------------------------------------------*
*& 모듈        : MM
*& 프로그램 ID : ZGTMMR4300
*& 프로그램 명 : 임가공 배치 투입 전송 관리
*& 개요   : 임가공 구매 오더에 투입된 배치 자재 실적을 전송, 이력 조회하는 프로그램
*& 생성일 : 2026.01.07
*& 생성자 : ZGODEV07
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : SAP -> EAI -> MES
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요:
*&---------------------------------------------------------------------*
REPORT ZGTMMR4300 MESSAGE-ID ZGTMM01.

INCLUDE ZGTMMR4300TOP.  "Global Variables & Types / Screen
INCLUDE ZGTMMR4300C01.  "Class - ALV
INCLUDE ZGTMMR4300O01.  "PBO
INCLUDE ZGTMMR4300I01.  "PAI
INCLUDE ZGTMMR4300F01.  "Sub-routines
INCLUDE ZGTMMR4300F02.  "Sub-routines for ALV
INCLUDE ZGTMMR4300E01.  "Event
