*&---------------------------------------------------------------------*
*& 모듈        : MM
*& 프로그램 ID : ZGTMMR4351
*& 프로그램 명 : FIBER 입고 정보 전송 관리
*& 개요   : FIBER 입고 정보를 전송, 이력 조회하는 프로그램
*& 생성일 : 2026.05.20
*& 생성자 : ZGODEV03
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : SAP -> EAI -> MES
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요:
*&---------------------------------------------------------------------*
REPORT ZGTMMR4351 MESSAGE-ID ZGTMM01.

INCLUDE ZGTMMR4351TOP.
INCLUDE ZGTMMR4351S01.
INCLUDE ZGTMMR4351C01.
INCLUDE ZGTMMR4351O01.
INCLUDE ZGTMMR4351I01.
INCLUDE ZGTMMR4351F01.
INCLUDE ZGTMMR4351F02.
INCLUDE ZGTMMR4351E01.
