*&---------------------------------------------------------------------*
*& 모듈        : MM
*& 프로그램 ID : ZGTMMR4360   ZGTMMR4320
*& 프로그램 명 : SCR 구매 입고 관리
*& 개요   : 전기동, SCR임가공 구매에 대해 소재 MOM에서 입고 및 출하한 이력 데이터 조회 및
*              업체 실적 정보를 참조하여 구매 입고 처리하는 프로그램 개발
*& 생성일 : 2026.06.17
*& 생성자 : ZGODEV04
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요:
*&---------------------------------------------------------------------*
REPORT ZGTMMR4360 MESSAGE-ID ZGTMM01.

INCLUDE ZGTMMR4360TOP.  "Global Variables & Types / Screen
INCLUDE ZGTMMR4360C01.  "Class - ALV
INCLUDE ZGTMMR4360O01.  "PBO
INCLUDE ZGTMMR4360I01.   "PAI
INCLUDE ZGTMMR4360F01. "Sub-routines
INCLUDE ZGTMMR4360F02. "Sub-routines for ALV
INCLUDE ZGTMMR4360E01. "Event
