*&---------------------------------------------------------------------*
*& 모듈        : MM
*& 프로그램 ID : ZGTMMR4380
*& 프로그램 명 : 재고실사 조회/차이조정 관리
*& 개요   : MES 에서 수신된 재고실사 정보를 기준으로 물자창고에 대한 재고 차이 확인 미 조정 처리 프로그램 개발
*& 생성일 : 2026.04.20
*& 생성자 : ZGODEV07
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  : 2026.07.27
*& 수정자  : ZGODEV04
*& 수정개요: 실사수량 계산식 변경(SAP재고수량+차이수량)
*& 수정일  : 2026.08.05
*& 수정자  : ZGODEV04
*& 수정개요: 조회조건 구매그룹 추가 및 구매그룹 요건에 따른 데이터 조정
*&---------------------------------------------------------------------*
REPORT ZGTMMR4380 MESSAGE-ID ZGTMM01.

INCLUDE ZGTMMR4380TOP.  "Global Variables & Types / Screen
INCLUDE ZGTMMR4380C01.  "Class - ALV
INCLUDE ZGTMMR4380O01.  "PBO
INCLUDE ZGTMMR4380I01.  "PAI
INCLUDE ZGTMMR4380F01.  "Sub-routines
INCLUDE ZGTMMR4380F02.  "Sub-routines for ALV
INCLUDE ZGTMMR4380E01.  "Event
