FUNCTION ZGTMM_IF_O_SCISSUE_SEND.
*"----------------------------------------------------------------------
*"*"Local Interface:
*"  IMPORTING
*"     VALUE(I_SYSTEM_ID) TYPE  CHAR04
*"  EXPORTING
*"     VALUE(ZO_RESULT) TYPE  ZO_RESULT
*"     VALUE(ZO_MESSAGE) TYPE  ZO_MESSAGE
*"  TABLES
*"      OT_ITEM STRUCTURE  ZGTMMS4000
*"----------------------------------------------------------------------
*&---------------------------------------------------------------------*
*& 모듈          : MM
*& 프로그램 ID : ZGTMM_IF_O_SCISSUE_SEND
*& 프로그램 명 :  임가공 투입 자재 전송(SAP->MES)
*& 개요   : 임가공 구매 오더에 투입된 배치자재 실적을 전송하는 FUNCTION
*& 생성일 : 2026.01.08
*& 생성자 : ZGODEV07
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요:
*&---------------------------------------------------------------------*




ENDFUNCTION.
