*&---------------------------------------------------------------------*
*& Include          ZGTMMR1040E01
*&---------------------------------------------------------------------*

*----------------------------------------------------------------------*
* INITIALIZATION
*----------------------------------------------------------------------*
INITIALIZATION.
  PERFORM F_INITIALIZATION.

*----------------------------------------------------------------------*
* AT SELECTION-SCREEN
*----------------------------------------------------------------------*
AT SELECTION-SCREEN.
  "초기화면 입력 값 점검
  PERFORM F_CHECK_FIELD_VALUE_1000.

AT SELECTION-SCREEN OUTPUT.
  "초기화면 설정
  PERFORM F_SET_SCREEN_ATTR_1000.

AT SELECTION-SCREEN ON VALUE-REQUEST FOR P_FILE.
  "파일 경로
  PERFORM F_F4_FILE USING P_FILE.

*----------------------------------------------------------------------*
* START-OF-SELECTION
*----------------------------------------------------------------------*
START-OF-SELECTION.
  PERFORM F_START_OF_SELECTION.

*----------------------------------------------------------------------*
* END-OF-SELECTION
*----------------------------------------------------------------------*
END-OF-SELECTION.
  PERFORM F_END_OF_SELECTION.
