*&---------------------------------------------------------------------*
*& 모듈        : MM
*& 프로그램 ID : ZGTMMR1040
*& 프로그램 명 : 드럼 단가/정보 관리
*& 개요   : [가온전선] 목드럼의 연간 계약 단가를 등록/수정하고 G-SRM으로 전송하는 프로그램
*& 생성일 : 2026.03.03
*& 생성자 : ZGODEV07
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요:
*&---------------------------------------------------------------------*
REPORT ZGTMMR1040 MESSAGE-ID ZGTMM01.

INCLUDE ZGTMMR1040TOP.  "Global Variables & Types / Screen
INCLUDE ZGTMMR1040C01.  "Class - ALV
INCLUDE ZGTMMR1040O01.  "PBO
INCLUDE ZGTMMR1040I01.  "PAI
INCLUDE ZGTMMR1040F01.  "Sub-routines
INCLUDE ZGTMMR1040F02.  "Sub-routines for ALV
INCLUDE ZGTMMR1040E01.  "Event
