*&---------------------------------------------------------------------*
*& 모듈        : MM
*& 프로그램 ID : ZGTMMR4270
*& 프로그램 명 : 드럼 실적 관리
*& 개요   : [가온전선] G-SRM에서 수신한 실적 데이터를 기반으로 목드럼을 입고처리(일)하고,
*              월 실적을 조회하는 프로그램
*& 생성일 : 2026.03.18
*& 생성자 : ZGODEV07
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요:
*&---------------------------------------------------------------------*
REPORT ZGTMMR4270 MESSAGE-ID ZGTMM01.

INCLUDE ZGTMMR4270TOP.  "Global Variables & Types / Screen
INCLUDE ZGTMMR4270C01.  "Class - ALV
INCLUDE ZGTMMR4270O01.  "PBO
INCLUDE ZGTMMR4270I01.  "PAI
INCLUDE ZGTMMR4270F01.  "Sub-routines
INCLUDE ZGTMMR4270F02.  "Sub-routines for ALV
INCLUDE ZGTMMR4270E01.  "Event
