*&---------------------------------------------------------------------*
*& 모듈        : MM
*& 프로그램 ID : ZGTMMR4390
*& 프로그램 명 : 재고 현황 조회
*& 개요   :
*& 생성일 : 2026.04.14
*& 생성자 : ZGODEV04
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요:
*&---------------------------------------------------------------------*
REPORT ZGTMMR4390 MESSAGE-ID ZGTMM01.

INCLUDE ZGTMMR4390TOP.  "Global Variables & Types / Screen
*INCLUDE ZGTMMR4390C01.  "Class - ALV
INCLUDE ZGTMMR4390O01.  "PBO
INCLUDE ZGTMMR4390I01.  "PAI
INCLUDE ZGTMMR4390F01.  "Sub-routines
INCLUDE ZGTMMR4390F02.  "Sub-routines for ALV
INCLUDE ZGTMMR4390E01.  "Event
