FUNCTION ZGTMM_IF_O_POSEND.
*"----------------------------------------------------------------------
*"*"Local Interface:
*"  IMPORTING
*"     VALUE(I_SYSTEM_ID) TYPE  CHAR04
*"  EXPORTING
*"     VALUE(ZO_RESULT) TYPE  ZO_RESULT
*"     VALUE(ZO_MESSAGE) TYPE  ZO_MESSAGE
*"  TABLES
*"      OT_TAB01 STRUCTURE  ZGTMMSIF0002
*"      OT_TAB02 STRUCTURE  ZGTMMSIF0003
*"      OT_TAB03 STRUCTURE  ZGTMMSIF0004
*"----------------------------------------------------------------------
*&---------------------------------------------------------------------*
*& 모듈          : MM
*& 프로그램 ID : ZGTMM_IF_O_POSEND
*& 프로그램 명 : 구매오더 정보 송신
*& 개요   : 구매오더 정보 송신용 RFC (To 지중MES)
*& 생성일 : 2024.11.06
*& 생성자 : ZGSIDEV03
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요:
*&---------------------------------------------------------------------*





ENDFUNCTION.
