*&---------------------------------------------------------------------*
*& 모듈풀            SAPMZLE0002                                       *
************************************************************************
*  Program ID  : ZGTMMR4550(SAPMZLE0002)                               *
*  Title       : [FI] 기타통문 요청                                    *
*  Create Date : 2026.05.21(2004. 12. 13)                                          *
*  Author      : SDC10                                                 *
*  Frequency   : Frequency                                             *
*  GAP NO      : LES022                                                *
*  DESCRIPTION : 기존 SAPMZLE0002 프로그램 복사 생성 후 테이블 및 티코드 변경                                                   *
************************************************************************
*  Changed by  |  Description of change                    |  Date     *
*              |                                           |           *
*  S.J.NAM     |기능개선44943 - 통문증 발행시              |           *
*              |타사의 플랜트 입력 방지                    |2014.09.29 *
*  H.M.LIM     |기능개선48112 - 기타통문증 요청 화면 변경  |2014.10.15 *
*  H.M.LIM     |기능개선48116 - 기타통문 결재 프로세스 도입|2014.10.21 *
************************************************************************
*                        MODIFICATION LOG
*-----------------------------------------------------------------------
*  Date.     Author.  CSR#.            Description.
*-----------------------------------------------------------------------
* 2014.11.07 S.J.Nam  자체개선 52275   기타통문 발행시 가이드메시지 추가
* 2014.11.13 H.M.LIM  자체개선 52915   구매처,납품처 코드 길이 수정
* 2015.04.02 S.J.NAM  기능개선 43039   결재/합의자 개인ID 사용자로 제한
* 2016.11.16 G.T.JUNG 기능개선 166652  필드 대여업체 코드 추가
* 2018.06.25 노승남   기능개선 239718  LS MTRON 통문 승인 기능 추가
* 2018.10.24 노승남   기능개선 251794  BUKRS '3000'인 경우 사유필드 추가
* 2019.02.18 ZLSGSD   기능개선 266459  승인자 체크로직 추가 외 (U1)
* 2020.08.21 ZLSGSD   CHM2008-00308    자산 가격 오류 수정
* 2022.03.24 ZLSGSD4  SRM2203-07882    엠트론 자산코드 오류메세지 추가
* 2022.09.23 ZLSGSD   SRM2209-05218    트랙터부품 사외이전 관련 통문개선
************************************************************************

INCLUDE ZGTMMR4550TOP.                   " Global Data
INCLUDE ZGTMMR4550O02.                   " PBO-Modules
INCLUDE ZGTMMR4550I02.                    " PAI-Modules
INCLUDE ZGTMMR4550F02.                   " FORM-Routines
