*&---------------------------------------------------------------------*
*& 모듈          : MM
*& 프로그램 ID : ZGTMMR1000
*& 프로그램 명 : 플랜트 별 GT 기능 적용 관리
*& 개요   : 직납 적용 플랜트 관리 프로그램
*&            과제 구분 코드를 사용하여 외주 재고 통제, 적정 재고 관리 시에도 활용
*& 생성일 : 2024.10.01
*& 생성자 : ZGSIDEV03
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요:
*&---------------------------------------------------------------------*
REPORT ZGTMMR1000 NO STANDARD PAGE HEADING MESSAGE-ID ZGTMM01.


INCLUDE ZGTMMR1000TOP.
INCLUDE ZGTMMR1000C01.
INCLUDE ZGTMMR1000O01.
INCLUDE ZGTMMR1000I01.
INCLUDE ZGTMMR1000F01.


*----------------------------------------------------------------------*
* INITIALIZATION
*----------------------------------------------------------------------*
INITIALIZATION.
* PERFORM SET_INIT.

*----------------------------------------------------------------------*
* AT SELECTION-SCREEN
*----------------------------------------------------------------------*
AT SELECTION-SCREEN.
  PERFORM CHECK_COND.
* PERFORM CHECK_AUTH.

*----------------------------------------------------------------------*
* START-OF-SELECTION
*----------------------------------------------------------------------*
START-OF-SELECTION.
  IF P_BUKRS IS INITIAL.
    MESSAGE S001 DISPLAY LIKE 'E'. "회사코드가 누락되었습니다.
    EXIT.
  ELSE.
    PERFORM GET_BUTXT.
    PERFORM GET_KEY.
    PERFORM GET_DD07V.
  ENDIF.

  PERFORM GET_DATA.

  CALL SCREEN 100.
