*&--------------------------------------------------------*
*& 모듈           : MM                                                                              *
*& 프로그램 ID : ZGTMMR1030                                                                *
*& 프로그램 명 : [MM] 구매그룹 담당자 관리                                               *
*& 개요          :가온전선_구매그룹 별 담당자 사번 매핑 관리 프로그램               *
*& 생성일       : 2025.12.18                                                                     *
*& 생성자      : ZGODEV04                                                                      *
*&--------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A                                                            *
*& 타 시스템 인터페이스 개요 : N/A                                                           *
*&-------------------------------------------------------*
*& 프로그램 수정이력
*&-------------------------------------------------------*
*&     수정일             수정자             수정개요
*& ----------   ---------  ---------------------------------*
*&
*&-------------------------------------------------------*
REPORT ZGTMMR1030 MESSAGE-ID ZGTMM01.

*&-------------------------------------------------------*
*&    INCLUDE.
*&-------------------------------------------------------*
INCLUDE ZGTMMR1030TOP.     " GLOBAL DATA
INCLUDE ZGTMMR1030C01.      " ALV CLASS
INCLUDE ZGTMMR1030O01.     " PBO-MODULES
INCLUDE ZGTMMR1030I01.      " PAI-MODULES
INCLUDE ZGTMMR1030F01.    " FORM-ROUTINES


*&---------------------------------------------------------------------*
*&    INITIALIZATION.
*&---------------------------------------------------------------------*
INITIALIZATION.
  PERFORM INITIALIZATION. "초기값 세팅

*&---------------------------------------------------------------------*
*&    AT SELECTION-SCREEN.
*&---------------------------------------------------------------------*
AT SELECTION-SCREEN OUTPUT.
*  PERFORM SELECTION_SCREEN_OUTPUT. "스크린 PBO

AT SELECTION-SCREEN.
  PERFORM CHECK_AUTH.
*&---------------------------------------------------------------------*
*&    START-OF-SELECTION.
*&---------------------------------------------------------------------*
START-OF-SELECTION.

  PERFORM INPUT_VALIDATION.      "INPUT DATA VALIDATION CHECK
  CHECK GV_ERR IS INITIAL.

*  PERFORM CHECK_AUTH USING P_BUKRS. "권한 체크

  PERFORM GET_DATA.

*&---------------------------------------------------------------------*
*&    END-OF-SELECTION.
*&---------------------------------------------------------------------*
END-OF-SELECTION.

*  CHECK GV_ERR IS INITIAL.
  CALL SCREEN 100.
