*&---------------------------------------------------------------------*
*& 모듈        : MM
*& 프로그램 ID : ZGTMMR2010
*& 프로그램 명 : 구매요청 생성/조회
*& 개요   : 원부자재, 외주가공 및 비상비 자재 구매 요청 개별 생성 혹은 일괄 생성을 위한 프로그램 개발
*& 생성일 : 2026.03.09
*& 생성자 : ZGODEV07
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요:
*&---------------------------------------------------------------------*
REPORT ZGTMMR2010 MESSAGE-ID ZGTMM01.

INCLUDE ZGTMMR2010TOP.  "Global Variables & Types / Screen
INCLUDE ZGTMMR2010C01.  "Class - ALV
INCLUDE ZGTMMR2010O01.  "PBO
INCLUDE ZGTMMR2010I01.  "PAI
INCLUDE ZGTMMR2010F01.  "Sub-routines
INCLUDE ZGTMMR2010F02.  "Sub-routines for ALV
INCLUDE ZGTMMR2010E01.  "Event
