*&---------------------------------------------------------------------*
*& 모듈        : MM
*& 프로그램 ID : ZGTMMR5030
*& 프로그램 명 : OEM 입고 정산 대상 조회
*& 개요   : OEM 정산을 위한 입고 내역과 정산 금액을 조회하는 프로그램 개발
*& 생성일 : 2026.07.30
*& 생성자 : ZGODEV04
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요:
*&---------------------------------------------------------------------*
REPORT ZGTMMR5030 MESSAGE-ID ZGTMM01.

INCLUDE ZGTMMR5030TOP. "Global Variables & Types / Screen
INCLUDE ZGTMMR5030C01. "CLASS
INCLUDE ZGTMMR5030O01. "PBO
INCLUDE ZGTMMR5030I01.  "PAI
INCLUDE ZGTMMR5030F01. "Sub-routines
INCLUDE ZGTMMR5030F02."Sub-routines for ALV


*----------------------------------------------------------------------*
* INITIALIZATION
*----------------------------------------------------------------------*
INITIALIZATION.
  PERFORM INITIALIZATION.

*----------------------------------------------------------------------*
* AT SELECTION-SCREEN
*----------------------------------------------------------------------*
AT SELECTION-SCREEN OUTPUT.
*  PERFORM SELECTION_SCREEN_OUTPUT. "스크린 PBO

AT SELECTION-SCREEN.
  PERFORM CHECK_AUTH.

*----------------------------------------------------------------------*
* START-OF-SELECTION
*----------------------------------------------------------------------*
START-OF-SELECTION.
  PERFORM F_START_OF_SELECTION.

*----------------------------------------------------------------------*
* END-OF-SELECTION
*----------------------------------------------------------------------*
END-OF-SELECTION.
  PERFORM F_END_OF_SELECTION.
