*&---------------------------------------------------------------------*
*& 모듈        : MM
*& 프로그램 ID : ZGTMMR4310
*& 프로그램 명 : 공급업체 납품서 전송 관리
*& 개요   : 공급업체에서 발행산 납품서 정보를 PDA로 전송 이력 관리하는 PROGRAM 개발
*& 생성일 : 2026.01.21
*& 생성자 : ZGODEV07
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : SAP -> EAI -> MES
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요:
*&---------------------------------------------------------------------*
REPORT ZGTMMR4310 MESSAGE-ID ZGTMM01.

INCLUDE ZGTMMR4310TOP.  "Global Variables & Types / Screen
INCLUDE ZGTMMR4310C01.  "Class - ALV
INCLUDE ZGTMMR4310O01.  "PBO
INCLUDE ZGTMMR4310I01.  "PAI
INCLUDE ZGTMMR4310F01.  "Sub-routines
INCLUDE ZGTMMR4310F02.  "Sub-routines for ALV
INCLUDE ZGTMMR4310E01.  "Event
