*&---------------------------------------------------------------------*
*& 모듈          : MM
*& 프로그램 ID : ZGTMMI6010
*& 프로그램 명 : [BD] 정보레코드 송신 배치
*& 개요   : 부스닥트 견적 산출 시스템에 변경된 단가를 송신 한다
*& 생성일 : 2024.12.19
*& 생성자 : ZGSIDEV05
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요:
*&---------------------------------------------------------------------*
REPORT ZGTMMI6010 NO STANDARD PAGE HEADING MESSAGE-ID ZGTMM01.


INCLUDE ZGTMMI6010TOP.
INCLUDE ZGTMMI6010C01.
INCLUDE ZGTMMI6010O01.
INCLUDE ZGTMMI6010I01.
INCLUDE ZGTMMI6010F01.


*----------------------------------------------------------------------*
* INITIALIZATION
*----------------------------------------------------------------------*
INITIALIZATION.
  PERFORM SET_INIT.

*----------------------------------------------------------------------*
* AT SELECTION-SCREEN OUTPUT
*----------------------------------------------------------------------*
AT SELECTION-SCREEN OUTPUT.
  PERFORM MODIFY_SCREEN.

*----------------------------------------------------------------------*
* AT SELECTION-SCREEN
*----------------------------------------------------------------------*
AT SELECTION-SCREEN.
* PERFORM CHECK_AUTH.

*----------------------------------------------------------------------*
* AT SELECTION-SCREEN ON
*----------------------------------------------------------------------*
AT SELECTION-SCREEN ON VALUE-REQUEST FOR P_IFSYT.
  PERFORM F4_IFSYT USING 'P_IFSYT'.

*----------------------------------------------------------------------*
* START-OF-SELECTION
*----------------------------------------------------------------------*
START-OF-SELECTION.
  PERFORM CHECK_COND.
  PERFORM GET_DATA.

  CHECK GV_CNT IS NOT INITIAL.

  IF SY-BATCH = GC_X.
    PERFORM SEND_DATA USING ' '.
  ELSE.
    IF P_ILOG IS NOT INITIAL.
      CALL SCREEN 100.
    ELSE.
      PERFORM SEND_DATA USING ' '.
    ENDIF.
  ENDIF.
