FUNCTION ZGTMM_BDMES_RPOGR_SEND.
*"----------------------------------------------------------------------
*"*"Local Interface:
*"  IMPORTING
*"     VALUE(I_SYSTEM_ID) TYPE  CHAR04
*"  EXPORTING
*"     VALUE(ZO_RESULT) TYPE  ZO_RESULT
*"     VALUE(ZO_MESSAGE) TYPE  ZO_MESSAGE
*"  TABLES
*"      OT_ITAB STRUCTURE  ZGTMMSIF0074
*"----------------------------------------------------------------------
*&---------------------------------------------------------------------*
*& 모듈          : MM
*& 프로그램 ID : ZGTMM_BDMES_RPOGR_SEND
*& 프로그램 명 : [BD] 원자재 입고 I/F 송신
*& 개요   : 부스닥트 원자재 입고 내역 전송용 RFC (To 부스닥트 MES)
*& 생성일 : 2025.02.18
*& 생성자 : ZGSIDEV03
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요:
*&---------------------------------------------------------------------*




ENDFUNCTION.
