*&---------------------------------------------------------------------*
*& 모듈          : MM
*& 프로그램 ID : ZGTMMR4919
*& 프로그램 명 : G/L 계정 마스터 전송 관리
*& 개요   : G/L 계정 마스터 전송 관리(To WMS)
*& 생성일 : 2025.06.16
*& 생성자 : ZGSIDEV03
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요:
*&---------------------------------------------------------------------*
REPORT ZGTMMR4919 NO STANDARD PAGE HEADING MESSAGE-ID ZGTMM01.


INCLUDE ZGTMMR4919TOP.
INCLUDE ZGTMMR4919C01.
INCLUDE ZGTMMR4919O01.
INCLUDE ZGTMMR4919I01.
INCLUDE ZGTMMR4919F01.


*----------------------------------------------------------------------*
* INITIALIZATION
*----------------------------------------------------------------------*
INITIALIZATION.
  PERFORM SET_INIT.

*----------------------------------------------------------------------*
* AT SELECTION-SCREEN OUTPUT
*----------------------------------------------------------------------*
AT SELECTION-SCREEN OUTPUT.
  PERFORM MODIFY_SCREEN.

*----------------------------------------------------------------------*
* AT SELECTION-SCREEN
*----------------------------------------------------------------------*
AT SELECTION-SCREEN.
* PERFORM CHECK_AUTH.

*----------------------------------------------------------------------*
* AT SELECTION-SCREEN ON
*----------------------------------------------------------------------*
AT SELECTION-SCREEN ON VALUE-REQUEST FOR P_IFSYT.
  PERFORM F4_IFSYT USING 'P_IFSYT'.

*----------------------------------------------------------------------*
* START-OF-SELECTION
*----------------------------------------------------------------------*
START-OF-SELECTION.
  PERFORM CHECK_COND.
  PERFORM GET_DATA USING 'X'.

  CHECK GV_CNT IS NOT INITIAL.

  IF P_SEND = GC_X AND P_BAT = GC_X.
    PERFORM SEND_DATA USING ' '.
  ELSE.
    CALL SCREEN 100.
  ENDIF.
