*&---------------------------------------------------------------------*
*& 모듈        : MM
*& 프로그램 ID : ZGTMMR9010
*& 프로그램 명 : 기초재고 마이그레이션
*& 개요   : 대상 재고 유형 별 기초 재고 업로드를 위한 프로그램 개발
*& 생성일 : 2026.02.19
*& 생성자 : ZGODEV07
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요:
*&---------------------------------------------------------------------*
REPORT ZGTMMR9010 MESSAGE-ID ZGTMM01.

INCLUDE ZGTMMR9010TOP.  "Global Variables & Types / Screen
INCLUDE ZGTMMR9010C01.  "Class - ALV
INCLUDE ZGTMMR9010O01.  "PBO
INCLUDE ZGTMMR9010I01.  "PAI
INCLUDE ZGTMMR9010F01.  "Sub-routines
INCLUDE ZGTMMR9010F02.  "Sub-routines for ALV
INCLUDE ZGTMMR9010E01.  "Event
