*&---------------------------------------------------------------------*
*& 모듈        : MM
*& 프로그램 ID : ZGTMMR4340
*& 프로그램 명 : 외주 임가공 투입 정보 관리
*& 개요   : 외주임가공 출고된 LOT 와 실적 정보 매핑 관리를 위한 프로그램 개발
*&            외주임가공 입고 처리 이전 투입정보와 구매오더 정보를 연결하여 하위 자재 투입시 참조 한다.
*& 생성일 : 2026.03.24
*& 생성자 : ZGODEV07
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요:
*&---------------------------------------------------------------------*
REPORT ZGTMMR4340 MESSAGE-ID ZGTMM01.

INCLUDE ZGTMMR4340TOP.  "Global Variables & Types / Screen
INCLUDE ZGTMMR4340C01.  "Class - ALV
INCLUDE ZGTMMR4340O01.  "PBO
INCLUDE ZGTMMR4340I01.  "PAI
INCLUDE ZGTMMR4340F01.  "Sub-routines
INCLUDE ZGTMMR4340F02.  "Sub-routines for ALV
INCLUDE ZGTMMR4340E01.  "Event
