*&--------------------------------------------------------*
*& 모듈           : MM                                                                              *
*& 프로그램 ID : ZGTMMR4370                                                                 *
*& 프로그램 명 : [MM] OEM 검사 요청 & 성적서 관리                                    *
*& 개요          : 가온전선_OEM 검사일정 등록 및 성적서 다운로드 가능한 프로그램
*& 생성일       : 2026.04.27                                                                     *
*& 생성자      : ZGODEV04                                                                      *
*&--------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A                                                            *
*& 타 시스템 인터페이스 개요 : N/A                                                           *
*&-------------------------------------------------------*
*& 프로그램 수정이력
*&-------------------------------------------------------*
*&     수정일             수정자             수정개요
*& ----------   ---------  ---------------------------------*
*&
*&-------------------------------------------------------*
REPORT ZGTMMR4370 MESSAGE-ID ZGTMM01.

*&-------------------------------------------------------*
*&    INCLUDE.
*&-------------------------------------------------------*
INCLUDE ZGTMMR4370TOP.   " GLOBAL DATA
INCLUDE ZGTMMR4370C01.    " ALV CLASS
INCLUDE ZGTMMR4370O01.     " PBO-MODULES
INCLUDE ZGTMMR4370I01.     " PAI-MODULES
INCLUDE ZGTMMR4370F01.    " FORM-ROUTINES


*&---------------------------------------------------------------------*
*&    INITIALIZATION.
*&---------------------------------------------------------------------*
INITIALIZATION.
   PERFORM INITIALIZATION.

*&---------------------------------------------------------------------*
*&    AT SELECTION-SCREEN.
*&---------------------------------------------------------------------*
AT SELECTION-SCREEN OUTPUT.
  PERFORM SELECTION_SCREEN_OUTPUT.

AT SELECTION-SCREEN.
  PERFORM CHECK_AUTH .

*----------------------------------------------------------------------*
* AT SELECTION-SCREEN ON
*----------------------------------------------------------------------*


*&---------------------------------------------------------------------*
*&    START-OF-SELECTION.
*&---------------------------------------------------------------------*
START-OF-SELECTION.

  PERFORM INPUT_VALIDATION.      "INPUT DATA VALIDATION CHECK
  CHECK GV_ERR IS INITIAL.

  PERFORM GET_DATA.

*&---------------------------------------------------------------------*
*&    END-OF-SELECTION.
*&---------------------------------------------------------------------*
END-OF-SELECTION.

  CHECK GV_ERR IS INITIAL.
  CASE GC_X.
    WHEN RB_DOWN.  "자재 성적서 DOWNLOAD
       CALL SCREEN 100.

    WHEN RB_OEM ."OEM 검사 관리
       CALL SCREEN 300.

    WHEN OTHERS.
  ENDCASE.
