*&--------------------------------------------------------*
*& 모듈           : MM                                                                              *
*& 프로그램 ID : ZGTMMR3010                                                                *
*& 프로그램 명 : [MM] 구매오더 진행 현황 모니터링                                     *
*& 개요          :가온전선_구매오더의 진행 현황을 조회 할 수 있는 프로그램        *
*& 생성일       : 2026.02.26                                                                    *
*& 생성자      : ZGODEV04                                                                      *
*&--------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A                                                            *
*& 타 시스템 인터페이스 개요 : N/A                                                           *
*&-------------------------------------------------------*
*& 프로그램 수정이력
*&-------------------------------------------------------*
*&     수정일             수정자             수정개요
*& ----------   ---------  ---------------------------------*
*&
*&-------------------------------------------------------*
REPORT ZGTMMR3010 MESSAGE-ID ZGTMM01.

*&-------------------------------------------------------*
*&    INCLUDE.
*&-------------------------------------------------------*
INCLUDE ZGTMMR3010TOP.    " GLOBAL DATA
INCLUDE ZGTMMR3010C01.     " ALV CLASS
INCLUDE ZGTMMR3010O01.    " PBO-MODULES
INCLUDE ZGTMMR3010I01.     " PAI-MODULES
INCLUDE ZGTMMR3010F01.   " FORM-ROUTINES


*&---------------------------------------------------------------------*
*&    INITIALIZATION.
*&---------------------------------------------------------------------*
INITIALIZATION.
  PERFORM INITIALIZATION. "초기값 세팅

*&---------------------------------------------------------------------*
*&    AT SELECTION-SCREEN.
*&---------------------------------------------------------------------*
AT SELECTION-SCREEN OUTPUT.
*  PERFORM SELECTION_SCREEN_OUTPUT. "스크린 PBO

AT SELECTION-SCREEN.

*&---------------------------------------------------------------------*
*&    START-OF-SELECTION.
*&---------------------------------------------------------------------*
START-OF-SELECTION.
  PERFORM CHECK_AUTH.
  PERFORM INPUT_VALIDATION.      "INPUT DATA VALIDATION CHECK
  CHECK GV_ERR IS INITIAL.

*  PERFORM CHECK_AUTH USING P_BUKRS. "권한 체크

  PERFORM GET_DATA.

*&---------------------------------------------------------------------*
*&    END-OF-SELECTION.
*&---------------------------------------------------------------------*
END-OF-SELECTION.

  CHECK GV_ERR IS INITIAL.
  CALL SCREEN 100.
