*&---------------------------------------------------------------------*
*& 모듈        : MM
*& 프로그램 ID : ZGTMMR9000
*& 프로그램 명 : BP Role 마이그레이션
*& 개요   : 회계 BP 생성 후 공급업체 Role 마이그레이션을 위한 프로그램 개발
*& 생성일 : 2026.02.12
*& 생성자 : ZGODEV07
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요:
*&---------------------------------------------------------------------*
REPORT ZGTMMR9000 MESSAGE-ID ZGTMM01.

INCLUDE ZGTMMR9000TOP.  "Global Variables & Types / Screen
INCLUDE ZGTMMR9000C01.  "Class - ALV
INCLUDE ZGTMMR9000O01.  "PBO
INCLUDE ZGTMMR9000I01.  "PAI
INCLUDE ZGTMMR9000F01.  "Sub-routines
INCLUDE ZGTMMR9000F02.  "Sub-routines for ALV
INCLUDE ZGTMMR9000E01.  "Event
