************************************************************************
* 모듈/서브모듈 : MM / 비철                                            *
* Type          : Module Pool                                          *
* GAP ID        : NF-111                                               *
* T_CODE        : ZNF2M2100                                            *
* Description   : 선물요청                                             *
************************************************************************
*                        MODIFICATION LOG                              *
*----------------------------------------------------------------------*
*   DATE        AUTHORS              DESCRIPTION                       *
* ----------   --------- --------------------------------------------- *
* 2012/02/06   SDC24     Initial Release                               *
* 2018/02/13   신재호    [기능개선 224268] 팝업창 제거                 *
* 2022/03/15   이원형    [CHM2110-00472] 반려 후 수정가능
* 2022/03/15   이원형    [CHM2112-00416] 반려 후 수정불가                 *
************************************************************************
* Comment :
************************************************************************

INCLUDE MZNF2300TOP                             .  " Global Data

INCLUDE MZNF2300O01                             .  " PBO-Modules

INCLUDE MZNF2300I01                             .  " PAI-Modules

INCLUDE ZNF2COMM.

INCLUDE MZNF2300F01                             .  " FORM-Routines
