************************************************************************
* 모듈/서브모듈 : MM / 비철                                            *
* Type          : Module Pool                                          *
* GAP ID        : NF-111                                               *
* T_CODE        : ZNF2M2100                                            *
* Description   : 선물요청 관리                                        *
************************************************************************
*                        MODIFICATION LOG                              *
*----------------------------------------------------------------------*
*   DATE        AUTHORS              DESCRIPTION                       *
* ----------   --------- --------------------------------------------- *
* 2012/02/06   SDC24     Initial Release                               *
************************************************************************
* Comment :
************************************************************************

INCLUDE MZNF2100TOP.                             .  " Global Data

INCLUDE MZNF2100O01.                             .  " PBO-Modules

INCLUDE MZNF2100I01.                             .  " PAI-Modules

INCLUDE MZNF2100F01.                             .  " FORM-Routines

INCLUDE ZNF2COMM.
