************************************************************************
* 모듈/서브모듈 : MM / 계약                                            *
* Type          : Module Pool                                          *
* GAP ID        : NF-111                                               *
* T_CODE        : ZNF2M2001                                            *
* Description   : 계약생성 / 수정 / 조회                               *
************************************************************************
*                        MODIFICATION LOG                              *
*----------------------------------------------------------------------*
*   DATE       AUTHORS              DESCRIPTION                        *
* ----------  --------- -----------------------------------------------*
* 2012/02/06   FIC23   Initial Release                                 *
* 2016/01/06   신재호  [기능개선 110852]일회성 고객코드(문자)입력 금지 *
* 2016/02/17   신재호  [기능개선 113555]첨부파일 저장/확장자 로직변경
************************************************************************
* Comment :
************************************************************************

INCLUDE MZNF2000TOP                             .  " global Data
INCLUDE MZNF2000O01                             .  " PBO-Modules
INCLUDE MZNF2000I01                             .  " PAI-Modules
INCLUDE MZNF2000F01                             .  " FORM-Routines
INCLUDE ZNF2COMM.
