*&---------------------------------------------------------------------*
*& 모듈        : PP
*& 프로그램 ID : SAPMZGTPPR1020
*& 프로그램 명 : [GT] 스크랩율 관리 2024.10.08 by ZGSIDEV07
*& 개요   : 조립품 스크랩(불량)과 컴포넌트 스크랩(Loss) 구분 관리
*&             제품 납선별 스크랩율 구분 관리
*& 생성일 : 2024.10.08
*& 생성자 : ZGSIDEV07
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요 :
*&---------------------------------------------------------------------*


INCLUDE MZGTPPR1020TOP.
INCLUDE MZGTPPR1020O01.
INCLUDE MZGTPPR1020I01.
INCLUDE MZGTPPR1020F01.
