FUNCTION ZGTPP_IF_O_CUTTING_ORD_INFO .
*"----------------------------------------------------------------------
*"*"Local Interface:
*"  IMPORTING
*"     VALUE(I_SYSTEM_ID) TYPE  CHAR04
*"  EXPORTING
*"     VALUE(ZO_RESULT) TYPE  ZO_RESULT
*"     VALUE(ZO_MESSAGE) TYPE  ZO_MESSAGE
*"  TABLES
*"      OT_ORDER_H STRUCTURE  ZGTPPSIF0039 OPTIONAL
*"      OT_ORDER_I STRUCTURE  ZGTPPSIF0040 OPTIONAL
*"      OT_BOM STRUCTURE  ZGTPPSIF0041 OPTIONAL
*"----------------------------------------------------------------------
*&---------------------------------------------------------------------*
*& 모듈        : PP
*& 프로그램 ID : ZGTPP_IF_O_CUTTING_ORD_INFO
*& 프로그램 명 : [GT]  절단오더 정보 송신
*& 개요   :
*& 생성일 : 2026.01.28
*& 생성자 : ZGODEV06
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요 :
*&---------------------------------------------------------------------*

ENDFUNCTION.
