FUNCTION ZGTPP_IF_O_PEG.
*"----------------------------------------------------------------------
*"*"Local Interface:
*"  IMPORTING
*"     VALUE(SYSTEM_ID) TYPE  CHAR04
*"  EXPORTING
*"     VALUE(ZO_RESULT) TYPE  ZO_RESULT
*"     VALUE(ZO_MESSAGE) TYPE  ZO_MESSAGE
*"  TABLES
*"      ET_GRP STRUCTURE  ZGTPPSIF0018
*"      ET_PEG STRUCTURE  ZGTPPSIF0019
*"----------------------------------------------------------------------
*&---------------------------------------------------------------------*
*& 모듈        : PP
*& 프로그램 ID : PP00010
*& 프로그램 명 : [GT] 패깅 정보 송신
*& 개요   : 패깅 정보 송신
*& 생성일 : 2024.11.26
*& 생성자 : ZLSGED1
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요 :
*&---------------------------------------------------------------------*




ENDFUNCTION.
