*&---------------------------------------------------------------------*
*& 모듈        : PP
*& 프로그램 ID : ZGTPPR2370
*& 프로그램 명 : [GT] 생산오더 품목별 판매오더 갱신 GAON 2026.09.15 by ZGSIDEV07
*& 개요   : 생산오더 품목별 판매오더 갱신
*& 생성일 : 2026.09.15
*& 생성자 : ZGSIDEV07
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요 :
*&---------------------------------------------------------------------*
REPORT ZGTPPR2370  MESSAGE-ID ZGTPP00.

INCLUDE ZGTPPR2370TOP.
INCLUDE ZGTPPR2370S01.
INCLUDE ZGTPPR2370F01.

START-OF-SELECTION.
  PERFORM PROC.
