*&---------------------------------------------------------------------*
*& 모듈        : PP
*& 프로그램 ID : ZGTPPR2071
*& 프로그램 명 : [GT] 월간 생산 계획
*& 개요 : 월간 생산 계획(절연)을 수립하기 위한 절연 설비 월별 가동일 수
*&           관리 및 비가동 계획을 관리하는 화면
*&           ZGTPPR2070(설비능력관리) 에서 연계되는 프로그램
*& 생성일 : 2025.05.02
*& 생성자 : ZGSIPP04
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요 :
*&---------------------------------------------------------------------*
REPORT ZGTPPR2071 MESSAGE-ID ZGTPP00.

INCLUDE ZGTPPR2071TOP.  "GLOBAL 변수, 테이블 및 ALV 변수
INCLUDE ZGTPPR2071S01.  " 조회 조건 관련
INCLUDE ZGTPPR2071O01.  "PBO
INCLUDE ZGTPPR2071C01.  "ALV 관련 로직
INCLUDE ZGTPPR2071F01.  "일반 로직 PERFORM 문
INCLUDE ZGTPPR2071F02.  "ALV 관련 PERFORM 문
INCLUDE ZGTPPR207101.   "PAI


*&---------------------------------------------------------------------*
INITIALIZATION.
*&---------------------------------------------------------------------*

  PERFORM SET_SCREEN_VALUE.

*&---------------------------------------------------------------------*
AT SELECTION-SCREEN.
*&---------------------------------------------------------------------*


*&---------------------------------------------------------------------*
AT SELECTION-SCREEN OUTPUT.
*&---------------------------------------------------------------------*

  PERFORM GET_PARAMETER_DESCRIPTION.
  PERFORM MODIFY_FIRST_SCREEN.

*&---------------------------------------------------------------------*
AT SELECTION-SCREEN ON VALUE-REQUEST FOR S_ARBPL-LOW.
*&---------------------------------------------------------------------*
*-- 설비(작업장) SEARCH HELP 정보 구성
  PERFORM SET_F4_ARBPL USING S_ARBPL-LOW.
*&---------------------------------------------------------------------*
AT SELECTION-SCREEN ON VALUE-REQUEST FOR S_ARBPL-HIGH.
*&---------------------------------------------------------------------*
  PERFORM SET_F4_ARBPL USING S_ARBPL-HIGH.


*&---------------------------------------------------------------------*
START-OF-SELECTION.
*&---------------------------------------------------------------------*

* 조회 조건 기준으로 기초 DATA 조회
  PERFORM GET_DATA.
  PERFORM MODIFY_DATA.

  CALL SCREEN 100.


*&---------------------------------------------------------------------*
END-OF-SELECTION.
*&---------------------------------------------------------------------*
