*&---------------------------------------------------------------------*
*& 모듈        : PP
*& 프로그램 ID : ZGTPPR2330
*& 프로그램 명 : [GT] 목드럼 재선정
*& 개요   :
*& 생성일 : 2026.05.08
*& 생성자 : ZGODEV06
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 2026.10.06  ZGODEV06  드럼 변경된 오더의 변경정보 전송 추가
*& 2026.10.07  ZGODEV06  생산오더 배치모드 'O', 자동지정 'X'  실행시 조장구성테이블 기준으로 드럼재배치
*&                              - 생산오더 릴리즈 해제 시점이나 생산오더 변경시 기존 입력된 드럼을 유지하기 위해
*&---------------------------------------------------------------------*
REPORT ZGTPPR2330 MESSAGE-ID ZGTPP00.

INCLUDE ZGTPPR2330TOP.
INCLUDE ZGTPPR2330S01.
INCLUDE ZGTPPR2330C01.
INCLUDE ZGTPPR2330O01.
INCLUDE ZGTPPR2330I01.
INCLUDE ZGTPPR2330F01.

*----------------------------------------------------------------------*
* INITIALIZATION                                                       *
*----------------------------------------------------------------------*
INITIALIZATION.
  PERFORM INITIALIZATION.

*----------------------------------------------------------------------*
* START-OF-SELECTION                                                   *
*----------------------------------------------------------------------*
START-OF-SELECTION.
  PERFORM START_OF_SELECTION.

*----------------------------------------------------------------------*
* END-OF-SELECTION                                                     *
*----------------------------------------------------------------------*
END-OF-SELECTION.
  PERFORM END_OF_SELECTION.
