*&---------------------------------------------------------------------*
*& 모듈        : PP
*& 프로그램 ID : ZGTPPR1120
*& 프로그램 명 : [GT] 라우팅 생성
*& 개요   :  정비되어 있는 제조표준 데이터(ZPPT0030~41)를 기반으로
*&           라우팅을 생성/삭제하며, 생산버전을 자동으로 생성/삭제한다
*&           기존 LS GT 기능으로 프로그램 ZPPM0044 이 존재하나,
*&           Overlap 필드 관리 & 생산버전 자동 생성/삭제를 위해 Copy 수정 개발함
*& 생성일 : 2026.01.06
*& 생성자 : ZGODEV06
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
REPORT zgtppr1120  MESSAGE-ID zgtpp00.

INCLUDE zgtppr1120top.
INCLUDE zgtppr1120s01.
INCLUDE zgtppr1120c01.
INCLUDE zgtppr1120o01.
INCLUDE zgtppr1120i01.
INCLUDE zgtppr1120f01.

INITIALIZATION.
  PERFORM initialization.

START-OF-SELECTION.
  PERFORM start_of_selection.
