*&---------------------------------------------------------------------*
*& 모듈        : PP
*& 프로그램 ID : ZGTPPR9994
*& 프로그램 명 : [GT] BOM 대량 삭제(임시) 2026.05.26 by ZGSIDEV07
*& 개요   :   특정 품목 하위의 BOM들을 선택 삭제하는 기능
*& 생성일 : 2026.05.26
*& 생성자 : ZGSIDEV07
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요 :
*&---------------------------------------------------------------------*
REPORT ZGTPPR9994 MESSAGE-ID ZGTPP00.

INCLUDE ZGTPPR9994TOP.
INCLUDE ZGTPPR9994S01.
INCLUDE ZGTPPR9994C01.
INCLUDE ZGTPPR9994I01.
INCLUDE ZGTPPR9994O01.
INCLUDE ZGTPPR9994F01.

START-OF-SELECTION.
  PERFORM GET_DATA.
  PERFORM PROC_DISP.
