*&---------------------------------------------------------------------*
*& 모듈        : PP
*& 프로그램 ID : ZGTPPR4080
*& 프로그램 명 : [GT] 월마감 점검 Cockpit
*& 개요   : 월마감 점검 프로그램
*& 생성일 : 2025.06.27
*& 생성자 : ZGSIDEV08
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요 :
*&---------------------------------------------------------------------*
REPORT ZGTPPR4080 MESSAGE-ID ZGTPP00.

INCLUDE ZGTPPR4080TOP.
INCLUDE ZGTPPR4080C01.
INCLUDE ZGTPPR4080H01.
INCLUDE ZGTPPR4080I01.
INCLUDE ZGTPPR4080O01.
INCLUDE ZGTPPR4080F01.

START-OF-SELECTION.
  PERFORM GET_DATA.

  CALL SCREEN 0100.
