*&---------------------------------------------------------------------*
*& 모듈        : PP
*& 프로그램 ID : ZGTPPR2290
*& 프로그램 명 : [GT] 생산 오더 관리
*& 개요   : 기존 정상 생산 오더를 참고하여 재작업(탈피) 오더를 생성하고
*&            필요한 경우 관련된 재생산 오더를 생성 할 수 있는 프로그램
*& 생성일 : 2026.03.05
*& 생성자 : ZGODEV06
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  : 2026.03.05
*& 수정자  : ZGODEV06
*& 수정개요 : 프로그램 ZGTPPR2030 복사 생성.
*&---------------------------------------------------------------------*
REPORT zgtppr2290 MESSAGE-ID zgtpp00.

INCLUDE zgtppr2290top.
INCLUDE zgtppr2290s01.
INCLUDE zgtppr2290c01.
INCLUDE zgtppr2290o01.
INCLUDE zgtppr2290i01.
INCLUDE zgtppr2290f01.

*----------------------------------------------------------------------*
* INITIALIZATION                                                       *
*----------------------------------------------------------------------*
INITIALIZATION.
  PERFORM initialization.

*----------------------------------------------------------------------*
* START-OF-SELECTION                                                   *
*----------------------------------------------------------------------*
START-OF-SELECTION.
  PERFORM start_of_selection.

*----------------------------------------------------------------------*
* END-OF-SELECTION                                                     *
*----------------------------------------------------------------------*
END-OF-SELECTION.
  PERFORM end_of_selection.
