*&---------------------------------------------------------------------*
*& 모듈        : PP
*& 프로그램 ID : ZGTPPR1000
*& 프로그램 명 : [GT]코드 마스터 관리 2024.10.02 by ZGSIDEV07
*& 개요   : 생산 전반적으로 사용되는 공통 코드에 대해 코드 마스터 생성/변경이 필요한 경우 등록 관리함
*              코드 마스터의 필드 구성 및 필드별 자릿수, 라벨 등을 기입한다
*& 생성일 : 2024.10.02
*& 생성자 : ZGSIDEV07
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요 :
*&---------------------------------------------------------------------*

REPORT zgtppr1000 MESSAGE-ID zgtpp00.

INCLUDE zgtppr1000t01.
INCLUDE zgtppr1000s01.
INCLUDE zgtppr1000c01.
INCLUDE zgtppr1000f01.

START-OF-SELECTION.

  PERFORM get_data_process.
  PERFORM call_screen_process.
