*&---------------------------------------------------------------------*
*& 모듈        : PP
*& 프로그램 ID : ZGTPPR3130
*& 프로그램 명 : [GT] 원자재 소요량 관리
*& 개요 : 월간 조장구성표 수립 이후, 생성된 생산오더를 기반으로
*&         원자재 소요량을 확인하고 비교를 수행함
*& 생성일 : 2025.05.12
*& 생성자 : ZGSIPP04
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요 :
*&---------------------------------------------------------------------*
REPORT ZGTPPR3130 MESSAGE-ID ZGTPP00.

INCLUDE ZGTPPR3130TOP. "GLOBAL 변수, 테이블 및 ALV 변수
INCLUDE ZGTPPR3130S01. " 조회 조건 관련
INCLUDE ZGTPPR3130O01. "PBO
INCLUDE ZGTPPR3130C01. "ALV 관련 로직
INCLUDE ZGTPPR3130F01. "일반 로직 PERFORM 문
INCLUDE ZGTPPR3130F02. "ALV 관련 PERFORM 문
INCLUDE ZGTPPR3130I01.  "PAI

*&---------------------------------------------------------------------*
INITIALIZATION.
*&---------------------------------------------------------------------*

  PERFORM SET_SCREEN_VALUE.

*&---------------------------------------------------------------------*
AT SELECTION-SCREEN.
*&---------------------------------------------------------------------*

*  CASE  sscrfields-ucomm.
*    WHEN  'FC01'.        "(FC01
*      CALL TRANSACTION 'ZGTPPT3293'. "어플리케이션 버튼 선택시 실행
*  ENDCASE.
*&---------------------------------------------------------------------*
AT SELECTION-SCREEN OUTPUT.
*&---------------------------------------------------------------------*

  PERFORM GET_PARAMETER_DESCRIPTION.
  PERFORM MODIFY_FIRST_SCREEN.

*&---------------------------------------------------------------------*
AT SELECTION-SCREEN ON VALUE-REQUEST FOR S_GRPNR-LOW.
*&---------------------------------------------------------------------*
*-- 조장 구성표 번호  SEARCH HELP 정보 구성
  PERFORM SET_F4_GRPNR USING TEXT-S03
                                     'GRPNR'
                            CHANGING S_GRPNR-LOW.

*&---------------------------------------------------------------------*
START-OF-SELECTION.
*&---------------------------------------------------------------------*

  PERFORM MTS_CHECK.
  CHECK GV_MTS_CHK <> 'X'.
* 조회 조건 기준으로 기초 DATA 조회
  PERFORM PROC_GET_DATA.

  PERFORM PROC_DISP.

*&---------------------------------------------------------------------*
END-OF-SELECTION.
*&---------------------------------------------------------------------*
