*&---------------------------------------------------------------------*
*& 모듈        : PP
*& 프로그램 ID : ZGTPPR2380
*& 프로그램 명 : [GT] 드럼번호 초기화 GAON 2026.09.15 by ZGSIDEV07
*& 개요   : 드럼번호 초기화
*& 생성일 : 2026.09.15
*& 생성자 : ZGSIDEV07
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요 :
*&---------------------------------------------------------------------*
REPORT ZGTPPR2380   MESSAGE-ID ZGTPP00.

INCLUDE ZGTPPR2380TOP.
INCLUDE ZGTPPR2380S01.
INCLUDE ZGTPPR2380F01.

START-OF-SELECTION.
  PERFORM PROC.
