*&---------------------------------------------------------------------*
*& 모듈           : PP
*& 프로그램 ID : ZGTPPR1050
*& 프로그램 명 : [GT] 생산 버젼 등록
*& 개요   : 품목코드의 조달유형 및 특별조달을 감안하여 기생성된 BOM,
*&           라우팅을 기반으로 생산버전을 생성하는 기능
*& 생성일 : 2024.11.15
*& 생성자 : ZGSIPP04
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요 :
*&---------------------------------------------------------------------*
REPORT zgtppr1050 MESSAGE-ID zgtpp00.
INCLUDE zgtppr1050top.    "Global 변수, 테이블 및 ALV 변수
INCLUDE zgtppr1050s01.    " 조회 조건 관련
INCLUDE zgtppr1050o01.    "PBO
INCLUDE zgtppr1050c01.    "ALV 관련 로직
INCLUDE zgtppr1050f01.    "일반 로직 PERFORM 문
INCLUDE zgtppr1050f02.    "ALV 관련 PERFORM 문
INCLUDE zgtppr050i01.     "PAI


*&---------------------------------------------------------------------*
INITIALIZATION.
*&---------------------------------------------------------------------*

  PERFORM set_screen_value.

*&---------------------------------------------------------------------*
AT SELECTION-SCREEN.
*&---------------------------------------------------------------------*

*&---------------------------------------------------------------------*
AT SELECTION-SCREEN OUTPUT.
*&---------------------------------------------------------------------*

  PERFORM set_screen_attribute.

*&---------------------------------------------------------------------*
START-OF-SELECTION.
*&---------------------------------------------------------------------*
* SCREEN 조건 기준으로 기초 DATA 조회
  PERFORM get_data.

*  기초 data 필드별 생성
  PERFORM modify_data.

  PERFORM modify_data_add.

  IF gt_disp[] IS INITIAL.
    MESSAGE s001.
  ELSE.

    IF p_C2 = 'X'.
      PERFORM batch_create_data.
    ELSE.
      CALL SCREEN 100.
    ENDIF.
  ENDIF.

*&---------------------------------------------------------------------*
END-OF-SELECTION.
*&---------------------------------------------------------------------*
