*&---------------------------------------------------------------------*
*& 모듈        : PP
*& 프로그램 ID : ZGTPPR9030
*& 프로그램 명 : 기초재고 마이그레이션
*& 개요   : 대상 재고 유형 별 기초 재고 업로드를 위한 프로그램 개발
*& 생성일 : 2026.06.25
*& 생성자 : ZGODEV04
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요:
*&---------------------------------------------------------------------*
REPORT ZGTPPR9030 MESSAGE-ID ZGTMM01.

INCLUDE ZGTPPR9030TOP.  "Global Variables & Types / Screen
INCLUDE ZGTPPR9030C01.   "Class - ALV
INCLUDE ZGTPPR9030O01.   "PBO
INCLUDE ZGTPPR9030I01.    "PAI
INCLUDE ZGTPPR9030F01.   "Sub-routines
INCLUDE ZGTPPR9030F02.   "Sub-routines for ALV
INCLUDE ZGTPPR9030E01.   "Event
