FUNCTION zgtpp_if_o_ext_conv_result.
*"----------------------------------------------------------------------
*"*"Local Interface:
*"  IMPORTING
*"     VALUE(I_SYSTEM_ID) TYPE  CHAR04
*"  EXPORTING
*"     VALUE(ZO_RESULT) TYPE  ZO_RESULT
*"     VALUE(ZO_MESSAGE) TYPE  ZO_MESSAGE
*"  TABLES
*"      OT_ZGTPPT3160 STRUCTURE  ZGTPPSIF0030 OPTIONAL
*"      OT_ZGTMMT6210 STRUCTURE  ZGTPPSIF0031 OPTIONAL
*"      OT_ZGTMMT6211 STRUCTURE  ZGTPPSIF0032 OPTIONAL
*"----------------------------------------------------------------------
*&---------------------------------------------------------------------*
*& 모듈        : PP
*& 프로그램 ID : ZGTPP_IF_0014
*& 프로그램 명 : [GT] 외주 전환 결과 송신
*& 개요   :
*& 생성일 : 2025.02.26
*& 생성자 : ZGSIDEV06
*&---------------------------------------------------------------------*
*& 외부 호출 프로그램 개요   : N/A
*& 타 시스템 인터페이스 개요 : N/A
*&---------------------------------------------------------------------*
*& 프로그램 수정이력
*&---------------------------------------------------------------------*
*& 수정일  :
*& 수정자  :
*& 수정개요 :
*&---------------------------------------------------------------------*

ENDFUNCTION.
